{
    "name": "十三经译注_春秋公羊传译注_哀公",
    "explanation": [
        "鲁哀公名蒋（《世本》、《史记·十二诸侯年表》），一作将（《史记·鲁周公世家》）。定公之子，定姒所生。如按《史记·六国年表》以周元王元年（前475）为战国之始，则哀公是“跨时代”（春秋末、战国初）的国君。他和他的伯父昭公命运相同，也不甘于三桓的专权，想借越国的力量除去三桓，在他即位的第二十七个年头，曾被三桓逐出鲁国，为此，《汉书·古今人表》又称他为出公。哀公十二年，继宣公十五年“初税亩”、成公元年“作丘甲”之后，季氏又推行“用田赋”，进一步加重人民负担，被孔子批评为“不度于礼，而贪冒无厌”。哀公十四年，西狩获麟，孔子叹道：“吾道穷矣。”《公羊传》、《穀梁传》经文都到此为止，相传孔子所修《春秋》原貌如此。《左传》经文增至哀公十六年夏四月己丑孔子卒，为孔门后人所续。《左传》传文则直至二十七年，终哀公之一生。哀公在位二十七年（前494—前468年）。"
    ],
    "original_texts": [
        "元年春王正月，公即位。楚子、陈侯、随侯、许男围蔡。鼷鼠食郊牛，改卜牛。夏四月辛巳，郊。秋，齐侯、卫侯伐晋。冬，仲孙何忌帅师伐邾娄。",
        "二年春王二月，季孙斯、叔孙州仇、仲孙何忌帅师伐邾娄，取漷东田及沂西田。癸巳，叔孙州仇、仲孙何忌及邾娄子盟于句绎。夏四月丙子，卫侯元卒。滕子来朝。晋赵鞅帅师纳卫世子蒯聩于戚。戚者何？卫之邑也。曷为不言入于卫？父有子，子不得有父也。秋八月甲戌，晋赵鞅帅师及郑轩达帅师战于栗，郑师败绩。冬十月，葬卫灵公。十有一月，蔡迁于州来。蔡杀其大夫公子驷。",
        "三年春，齐国夏、卫石曼姑帅师围戚。齐国夏曷为与卫石曼姑帅师围戚？伯讨也。此其为伯讨奈何？曼姑受命乎灵公而立辄，以曼姑之义，为固可以距之也。辄者曷为者也？蒯聩之子也。然则曷为不立蒯聩而立辄？蒯聩为无道，灵公逐蒯聩而立辄。然则辄之义可以立乎？曰：“可。”其可奈何？不以父命辞王父命，以王父命辞父命，是父之行乎子也。不以家事辞王事，以王事辞家事，是上之行乎下也。",
        "夏四月甲午，地震。五月辛卯，桓宫、僖宫灾。此皆毁庙也，其言灾何？复立也。曷为不言其复立？《春秋》见者不复见也。何以不言及？敌也。何以书？记灾也。季孙斯、叔孙州仇帅师城开阳。宋乐髡帅师伐曹。秋七月丙子，季孙斯卒。蔡人放其大夫公孙猎于吴。冬十月癸卯，秦伯卒。叔孙州仇、仲孙何忌帅师围邾娄。",
        "四年春王三月庚戌，盗弑蔡侯申。弑君贱者穷诸人，此其称盗以弑何？贱乎贱者也。贱乎贱者孰谓？谓罪人也。蔡公孙辰出奔吴。葬秦惠公。宋人执小邾娄子。夏，蔡杀其大夫公孙归姓、公孙霍。晋人执戎曼子赤归于楚。赤者何？戎曼子之名也。其言归于楚何？子北宫子曰：“辟伯晋而京师楚也。”城西郛。",
        "六月辛丑，蒲社灾。蒲社者何？亡国之社也。社者封也，其言灾何？亡国之社盖揜之，揜其上而柴其下。蒲社灾何以书？记灾也。秋八月甲寅，滕子结卒。冬十有二月，葬蔡昭公。葬滕顷公。",
        "五年春，城比。夏，齐侯伐宋。晋赵鞅帅师伐卫。秋九月癸酉，齐侯处臼卒。冬，叔还如齐。闰月，葬齐景公。闰不书，此何以书？丧以闰数也。丧曷为以闰数？丧数略也。",
        "六年春，城邾娄葭。晋赵鞅帅师伐鲜虞。吴伐陈。夏，齐国夏及高张来奔。叔还会吴于祖。",
        "秋七月庚寅，楚子轸卒。齐阳生入于齐。齐陈乞弑其君舍。弑而立者，不以当国之辞言之，此其以当国之辞言之何？为谖也。此其为谖奈何？景公问陈乞曰：“吾欲立舍，何如？”陈乞曰：“所乐乎为君者，欲立之则立之，不欲立则不立。君如欲立之，则臣请立之。”阳生谓陈乞曰：“吾闻子盖将不欲立我也。”陈乞曰：“夫千乘之主将废正而立不正，必杀正者。吾不立子者，所以生子者也。走矣！”与之玉节而走之。景公死而舍立，陈乞使人迎阳生于诸其家。除景公之丧，诸大夫皆在朝。陈乞曰：“常之母有鱼菽之祭，愿诸大夫之化我也。”诸大夫皆曰“诺”。于是皆之陈乞之家坐。陈乞曰：“吾有所为甲，请以示焉。”诸大夫皆曰“诺”。于是使力士举巨囊而至于中霤。诸大夫见之，皆色然而骇。开之，则闯然公子阳生也。陈乞曰：“此君也已。”诸大夫不得已，皆逡巡北面，再拜稽首而君之尔。自是往杀舍。冬，仲孙何忌帅师伐邾娄。宋向巢帅师伐曹。",
        "七年春，宋皇瑗帅师侵郑。晋魏曼多帅师侵卫。夏，公会吴于鄫。秋，公伐邾娄。八月己酉，入邾娄，以邾娄子益来。入不言伐，此其言伐何？内辞也，若使他人然。邾娄子益何以名？绝。曷为绝之？获也。曷为不言其获？内大恶讳也。宋人围曹。冬，郑驷弘帅师救曹。",
        "八年春王正月，宋公入曹，以曹伯阳归。曹伯阳何以名？绝。曷为绝之？灭也。曷为不言其灭？讳同姓之灭也。何讳乎同姓之灭？力能救之而不救也。吴伐我。夏，齐人取<imgalt=\"\"class=\"kindle-cn-inline-character\"src=\"Image00001.jpg\"/>及<imgalt=\"\"class=\"kindle-cn-inline-character\"src=\"Image00052.jpg\"/>。取外邑不书，此何以书？所以赂齐也。曷为赂齐？为以邾娄子益来也。归邾娄子益于邾娄。秋七月。冬十有二月癸亥，杞伯过卒。齐人归<imgalt=\"\"class=\"kindle-cn-inline-character\"src=\"Image00001.jpg\"/>及<imgalt=\"\"class=\"kindle-cn-inline-character\"src=\"Image00052.jpg\"/>。",
        "九年春王二月，葬杞僖公。宋皇瑗帅师取郑师于雍丘。其言取之何？易也。其易奈何？诈之也。夏，楚人伐陈。秋，宋公伐郑。冬十月。",
        "十年春王二月，邾娄子益来奔。公会吴伐齐。三月戊戌，齐侯阳生卒。夏，宋人伐郑。晋赵鞅帅师侵齐。五月，公至自伐齐。葬齐悼公。卫公孟<imgalt=\"\"class=\"kindle-cn-inline-character\"src=\"Image00009.jpg\"/>自齐归于卫。薛伯寅卒。秋，葬薛惠公。冬，楚公子结帅师伐陈。吴救陈。",
        "十有一年春，齐国书帅师伐我。夏，陈袁颇出奔郑。五月，公会吴伐齐。甲戌，齐国书帅师及吴战于艾陵。齐师败绩，获齐国书。秋七月辛酉，滕子虞母卒。冬十有一月，葬滕隐公。卫世叔齐出奔宋。",
        "十有二年春，用田赋。何以书？讥。何讥尔？讥始用田赋也。夏五月甲辰，孟子卒。孟子者何？昭公之夫人也。其称孟子何？讳娶同姓，盖吴女也。公会吴于橐皋。秋，公会卫侯、宋皇瑗于运。宋向巢帅师伐郑。冬十有二月，<imgalt=\"\"class=\"kindle-cn-inline-character\"src=\"Image00015.jpg\"/>。何以书？记异也。何异尔？不时也。",
        "十有三年春，郑轩达帅师取宋师于嵒。其言取之何？易也。其易奈何？诈反也。夏，许男戌卒。公会晋侯及吴子于黄池。吴何以称子？吴主会也。吴主会，则曷为先言晋侯？不与夷狄之主中国也。其言及吴子何？会两伯之辞也。不与夷狄之主中国，则曷为以会两伯之辞言之？重吴也。曷为重吴？吴在是，则天下诸侯莫敢不至也。楚公子申帅师伐陈。於越入吴。",
        "秋，公至自会。晋魏多帅师侵卫。此晋魏曼多也，曷为谓之晋魏多？讥二名，二名非礼也。葬许元公。九月，<imgalt=\"\"class=\"kindle-cn-inline-character\"src=\"Image00015.jpg\"/>。久十有一月，有星孛于东方。孛者何？彗星也。其言于东方何？见于旦也。何以书？记异也。盗杀陈夏<imgalt=\"\"class=\"kindle-cn-inline-character3\"src=\"Image00009.jpg\"/>夫。十有二月，<imgalt=\"\"class=\"kindle-cn-inline-character\"src=\"Image00015.jpg\"/>。",
        "十有四年春，西狩获麟。何以书？记异也。何异尔？非中国之兽也。然则孰狩之？薪采者也。薪采者则微者也，曷为以狩言之？大之也。曷为大之？为获麟大之也。曷为为获麟大之？麟者，仁兽也，有王者则至，无王者则不至。有以告者曰：“有麕而角者。”孔子曰：“孰为来者！孰为来者！”反袂拭面，涕沾袍。颜渊死，子曰：“噫，天丧予！”子路死，子曰：“天祝予！”西狩获麟，孔子曰：“吾道穷矣！”。",
        "《春秋》何以始乎隐？祖之所逮闻也。所见异辞，所闻异辞，所传闻异辞。何以终乎哀十四年？曰：备矣。君子曷为为《春秋》？拨乱世反诸正，莫近诸《春秋》。则未知其为是与，其诸君子乐道尧舜之道与。末不亦乐乎尧舜之知君子也，制《春秋》之义以俟后圣，以君子之为亦有乐乎此也。"
    ],
    "translations": [
        "元年春周历正月，哀公即位。楚昭王、陈闵公、随国国君、许国国君包围蔡国。鼷鼠吃了准备郊祭的牛，换一头牛来占卜。夏四月辛巳日，举行郊祭。秋，齐景公、卫灵公攻伐晋国。冬，仲孙何忌率领军队攻伐邾娄国。",
        "二年春周历二月，季孙斯、叔孙州仇、仲孙何忌率领军队攻伐邾娄，拿了漷水以东的田与沂水以西的田。癸巳日，叔孙州仇、仲孙何忌与邾娄隐公在句绎结盟。夏四月丙子，卫侯元去世。滕顷公来访。晋国的赵鞅率领军队使卫国的太子蒯聩进入戚邑。戚邑是什么地方？是卫国的城邑。为什么不说进入卫国？父亲可以取得儿子的所有，儿子不能取得父亲的所有。秋八月甲戌日，晋国的赵鞅率领军队与郑国的轩达在铁邑交战，郑国军队溃败。冬十月，安葬卫灵公。十一月，蔡国迁徙到州来。蔡国杀了它的大夫公子驷。",
        "三年春，齐国的国夏、卫国的石曼姑包围戚邑。齐国的国夏为什么与卫国的石曼姑率领军队包围戚邑？是一方之长的声讨。这怎样是一方之长的声讨？石曼姑受了卫灵公的遗命而立辄，从曼姑的道理来说，是本来可以抵拒蒯聩的。辄是做什么的？是蒯聩的儿子。这样的话那么为什么不立蒯聩而立辄？蒯聩所作所为无道，卫灵公驱逐了蒯聩而立辄。这样的话那么辄在道理上可以立吗？回答说：“可以的。”怎样可以？不用父亲的命令来不接受祖父的命令，而用祖父的命令来不接受父亲的命令，这是儿子实行父亲的命令。不用家里的事来不接受有关王法的事，而用有关王法的事来不接受家里的事，这是下面实行上面的命令。",
        "夏四月甲午日，地震。五月辛卯日，桓公的庙、僖公的庙火灾。这都是应该毁迁的庙，说它们火灾是为什么？是重新立的。为什么不说它们重新立？《春秋》出现过的就不再出现。为什么不说“及”，是因为地位同等。为什么写下？是记录灾情。季孙斯、叔孙州仇率领军队修筑开阳的城墙。宋国的乐髡率领军队攻伐曹国。秋七月丙子日，季孙斯去世。蔡国人把他们的大夫公孙猎放逐到吴国。冬十月癸卯，秦伯去世。叔孙州仇、仲孙何忌率领军队包围邾娄国。",
        "四年春周历三（当作二）月庚戌日，盗贼杀了蔡侯申。杀国君身份低微的一律称人，这称盗贼以杀是为什么？是比身份低微的还要低微。比身份低微的还要低微指谁？指犯过罪的人。蔡国的公孙辰出奔到吴国。安葬秦惠公。宋国人捉拿了小邾娄穆公。夏，蔡国杀了它的大夫公孙归姓、公孙霍。晋国人捉拿了戎曼子赤送回到楚国。赤是什么？是戎曼子的名字。说送回到楚国是为什么？子北宫子说：“是避免以晋国为方伯而以楚国为京师。”修筑西外城的城墙。",
        "六月辛丑，薄社火灾。蒲社是什么？是亡国之社。社是堆土筑成的，说火灾是为什么？亡国之社是有覆盖的，筑屋覆盖它的上面而堆木阻挡它的下面。蒲社火灾为什么写下？是记录灾情。秋八月甲寅日，滕子结去世。冬十二月，安葬蔡昭公。安葬滕顷公。",
        "五年春，修筑比邑的城墙。夏，齐景公攻伐宋国。晋国的赵鞅率领军队攻伐卫国。秋九月癸酉，齐侯处臼去世。冬，叔还前往齐国。闰月，安葬齐景公。闰月不写，这为什么写下？丧葬的事是连闰月也计算进去的。丧葬的事为什么连闰月也计算进去？丧葬的计算方法讲究减省。",
        "六年春，修筑邾娄葭的城墙。晋国的赵鞅率领军队攻伐鲜虞。吴国攻伐陈国。夏，齐国的国夏与高张前来投奔。叔还在祖邑与吴国会见。",
        "秋七月庚寅日，楚子轸去世。齐国的阳生进入到齐国。齐国的陈乞杀了他的国君舍。继杀掉国君而立的，不用掌握国政的用语来说他，这儿用掌握国政的用语来说他是为什么？是因为欺诈。怎样欺诈？齐景公问陈乞说：“我想要立舍，怎么样？”陈乞说：“乐于做国君的，想要立他就立他，不想立就不立。君公如果想要立他，那么臣子建议立他。”阳生对陈乞说：“我听说你好像将要不想立我了。”陈乞说：“拥有千乘兵车的国君打算废正而立不正，必定要杀掉名正言顺的。我不立你的原因，是为了保你活命。你走吧！”给了他玉节让他走。景公死而舍立为国君，陈乞派人把阳生迎回来安顿在自己家里。景公的丧期满了周年除去丧服时，众大夫都在朝廷上。陈乞说：“我孩子的娘备下了鱼豆之祭，希望众大夫不要送礼前来我家。”众大夫都说“好”。于是都到陈乞的家里坐下。陈乞说：“我有做好的甲胄，拿出来请大家看。”众大夫都说“好”。于是派遣大力士举着一只大口袋来到室中央。众大夫见了，都面色惊疑心里惊怕。把大口袋打开，露出头来原来是公子阳生。陈乞说：“这是国君。”众大夫不得已，都迟疑不决地面向北，拜了再拜叩头到地奉阳生为国君。从这时前去杀了舍。冬，仲孙何忌率领军队攻伐邾娄国。宋国的向巢率领军队攻伐曹国。",
        "七年春，宋国的皇瑗率领军队侵入郑国。晋国的魏曼多率领军队侵入卫国。夏，哀公在鄫国与吴国会见。秋，哀公攻伐邾娄国。八月己酉日，进入邾娄国，把邾娄子益带回国。记了进入就不说攻伐，这里说攻伐是为什么？是内部的隐讳之辞，好像使得是别人进入那样。邾娄子益为什么称名？是断绝他的爵位。为什么断绝他的爵位？是因为被俘获了。为什么不说他被俘获？是鲁国的大恶因而隐讳了。宋国人包围曹国。冬，郑国的驷弘率领军队救援曹国。",
        "八年春周历正月，宋景公进入曹国，把曹伯阳带了回去。曹伯阳为什么称名？是断绝他的爵位。为什么断绝他的爵位？是因为曹国灭亡了。为什么不说他灭亡？是隐讳同姓之国的灭亡。为什么隐讳同姓之国的灭亡？是因为鲁国力能救之而不救。吴国攻伐我国。夏，齐国人拿下了<imgalt=\"\"class=\"kindle-cn-inline-character\"src=\"Image00001.jpg\"/>邑与<imgalt=\"\"class=\"kindle-cn-inline-character\"src=\"Image00052.jpg\"/>邑。外国拿下城邑不写，这为什么写下？是用它们来贿赂齐国的。为什么贿赂齐国？是因为把邾娄子益带回鲁国来。送邾娄子益回到邾娄国。秋七月。冬十二月癸亥日，杞伯过去世。齐国人归还了<imgalt=\"\"class=\"kindle-cn-inline-character\"src=\"Image00001.jpg\"/>邑与<imgalt=\"\"class=\"kindle-cn-inline-character\"src=\"Image00052.jpg\"/>邑。",
        "九年春周历二月，安葬杞僖公。宋国的皇瑗率领军队在雍丘拿下了郑国军队。说拿下了是为什么？是容易。怎样容易？用欺诈的办法。夏，楚国人攻伐陈国。秋，宋景公攻伐郑国。冬十月。",
        "十年春周历二月，邾娄子益前来投奔。哀公会合吴国攻伐齐国。三月戊戌日，齐侯阳生去世。夏，宋国人攻伐郑国。晋国的赵鞅率领军队侵犯齐国。五月，哀公自伐齐处到达鲁国。安葬齐悼公。卫国的公孟<imgalt=\"\"class=\"kindle-cn-inline-character\"src=\"Image00009.jpg\"/>自齐国回到卫国。薛伯寅去世。秋，安葬薛惠公。冬，楚国的公子结率领军队攻伐陈国。吴国救援陈国。",
        "十一年春，齐国的国书率领军队攻伐我国。夏，陈国的袁颇出奔到郑国。五月，哀公会合吴国攻伐齐国。甲戌日，齐国的国书率领军队与吴国在艾陵交战。齐国军队溃败，俘获了齐国的国书。秋七月辛酉日，滕子虞母去世。冬十一月，安葬滕隐公。卫国的世叔齐出奔到宋国。",
        "十二年春，采用征田赋的政策。为什么写下？是讥讽。为什么讥讽这件事？是讥讽开始采用征田赋的政策。夏五月甲辰日，孟子去世。孟子是什么人？是昭公的夫人。称孟子是为什么？是隐讳娶同姓，大概是吴国的女儿吧。哀公在橐皋与吴国相会。伙，哀公在运邑会见卫出公、宋国的皇瑗。宋国的向巢率领军队攻伐郑国。冬十二月，蝗虫。为什么写下？是记录异常情况。为什么奇异这件事？是不合时令。",
        "十三年春，郑国的轩达率领军队在嵒邑拿下了宋国军队。说拿下了是什么意思？是容易。怎样容易？回报以欺诈的办法。夏，许男戌去世。哀公在黄池会见晋定公及吴子。吴为什么称子？是吴国在会上主盟。吴国在会上主盟，那么为什么先说晋定公？是不赞许夷狄成为中原各国之主。说“及吴子”是为什么？是两个霸主相会的用语。不赞许夷狄成为中原各国之主，那么为什么拿两个霸主相会的用语来说？是重视吴国。为什么重视吴国？吴国在这里，那么天下诸侯没有敢不到的。楚国的公子申率领军队攻伐陈国。越国进入了吴国。",
        "秋，哀公自会盟处到达鲁国。晋国的魏多率领军队侵犯卫国。这是晋国的魏曼多，为什么称他为晋国的魏多？是讥讽两个字的名字，两个字的名字是不合礼法的。安葬许元公。九月，蝗虫。冬十一月，有颗孛星出现在东方。孛星是什么？是彗星。说在东方是为什么？是出现在黎明的时候。为什么写下？是记录异常情况。盗贼杀了陈国的夏<imgalt=\"\"class=\"kindle-cn-inline-character\"src=\"Image00009.jpg\"/>夫。十二月，蝗虫。",
        "十四年春，在西境狩猎获得麒麟。为什么写下？是记录异常情况。为什么奇异这件事？因为它不是鲁国国中的兽类。这样的话那么是谁打猎打到的？是一个斫柴的。斫柴的那是低微的人，为什么用狩猎来说他？是抬高他。为什么抬高他？为得到麒麟而抬高他。为什么为得到麒麟而抬高他？麒麟，是仁兽，有王者就来到，没有王者就不来到。有把这个消息告诉孔子的说：“有一头像獐而长了角的。”孔子说：“为谁来的！为谁来的！”翻过衣袖擦脸，眼泪沾湿了袍子。颜渊死后，孔子说：“唉，天使我丧失了助手！”子路死后，孔子说：“天断了我臂膀！”在西境狩猎获得麒麟后，孔子说：“我的政治主张到此为止了！”",
        "《春秋》为什么从隐公开始？是祖辈所及于听说的。所看到的说法不一样，所听到的说法不一样，所传闻的说法不一样。为什么到哀公十四年结束？回答说：已经完备了。君子为什么修《春秋》？拨乱世返之于正，没有比《春秋》更近的。那就不知是这样呢，还是君子乐于叙说尧舜之道呢。孔子不是也很乐于尧舜的理解君子么，制订《春秋》的大义来等待后世的圣王，拿君子的所作所为来说，也是有乐于这一点的。"
    ],
    "marked_notes": [
        "元年春王正月，公即位。楚子、陈侯、随侯、许男围蔡。鼷鼠食郊牛，改卜牛。夏四月辛巳，郊。秋，齐侯、卫侯伐晋。冬，仲孙何忌帅师伐邾娄。",
        "二年春王二月，季孙斯、叔孙州仇、仲孙何忌帅师伐邾娄，取漷东田及沂西田。癸巳，叔孙州仇、仲孙何忌及邾娄子盟于**句绎**。夏四月丙子，**卫侯元**卒。滕子来朝。晋赵鞅帅师纳卫世子蒯聩于**戚**。戚者何？卫之邑也。曷为不言入于卫？**父有子，子不得有父也**。秋八月甲戌，晋赵鞅帅师**及郑轩达帅师战于栗**，郑师败绩。冬十月，葬卫灵公。十有一月，蔡迁于**州来**。**蔡杀其大夫公子驷**。",
        "三年春，齐国夏、卫石曼姑帅师围戚。齐国夏曷为与卫石曼姑帅师围戚？**伯讨**也。此其为伯讨奈何？曼姑受命乎灵公而立**辄**，以曼姑之义，为固可以**距**之也。辄者曷为者也？蒯聩之子也。然则曷为不立蒯聩而立辄？蒯聩为无道，**灵公逐蒯聩**而立辄。然则辄之义可以立乎？曰：“可。”其可奈何？不以父命**辞**王父命，以王父命辞父命，**是父之行乎子也**。不以家事辞**王事**，以王事辞家事，**是上之行乎下也**。",
        "夏四月甲午，地震。五月辛卯，桓宫、僖宫灾。此皆毁庙也，其言灾何？复立也。曷为不言其复立？《春秋》见者不复见也。何以不言及？敌也。何以书？记灾也。季孙斯、叔孙州仇帅师城开阳。宋乐髡帅师伐曹。秋七月丙子，季孙斯卒。蔡人放其大夫公孙猎于吴。冬十月癸卯，秦伯卒。叔孙州仇、仲孙何忌帅师围邾娄。",
        "四年春王三月庚戌，盗**弑**蔡侯申。**弑君贱者穷诸人**，此其称盗以弑何？贱乎贱者也。贱乎贱者孰谓？**谓罪人也**。蔡**公孙辰**出奔吴。葬秦惠公。宋人执小邾娄子。夏，蔡杀其大夫**公孙归姓、公孙霍**。**晋人执戎曼子赤归于楚**。赤者何？戎曼子之名也。其言归于楚何？子北宫子曰：“辟**伯晋而京师楚**也。”城西郛。",
        "六月辛丑，蒲社灾。蒲社者何？**亡国之社**也。**社者封也**，其言灾何？亡国之社盖揜之，**揜其上而柴其下**。蒲社灾何以书？记灾也。秋八月甲寅，**滕子结**卒。冬十有二月，**葬蔡昭公**。葬滕顷公。",
        "五年春，城比。夏，齐侯伐宋。晋赵鞅帅师伐卫。秋九月癸酉，**齐侯处臼**卒。冬，叔还如齐。闰月，葬齐景公。闰不书，此何以书？**丧以闰数**也。丧曷为以闰数？丧数**略**也。",
        "六年春，城邾娄葭。晋赵鞅帅师伐鲜虞。吴伐陈。夏，**齐国夏及高张来奔**。叔还会吴于祖。",
        "秋七月庚寅，楚子轸卒。齐**阳生**入于齐。齐**陈乞**弑其君舍。**弑而立者，不以当国之辞言之**，**此其以当国之辞言之何**？为**谖**也。此其为谖奈何？景公问陈乞曰：“吾欲立舍，何如？”陈乞曰：“所乐乎为君者，欲立之则立之，不欲立则不立。君如欲立之，**则臣请立之**。”阳生谓陈乞曰：“吾闻子盖将不欲立我也。”陈乞曰：“夫千乘之主将**废正而立不正**，必杀正者。吾不立子者，所以生子者也。走矣！”与之**玉节**而走之。景公死而舍立，陈乞使人迎阳生**于诸**其家。**除景公之丧**，诸大夫皆在朝。陈乞曰：“**常之母**有鱼菽之祭，愿诸大夫之**化**我也。”诸大夫皆曰“诺”。于是皆之陈乞之家坐。陈乞曰：“吾有所为甲，请以示焉。”诸大夫皆曰“诺”。于是使力士举巨囊而至于**中霤**。诸大夫见之，皆**色然**而骇。开之，则**闯然**公子阳生也。陈乞曰：“此君也已。”诸大夫不得已，皆逡巡北面，再拜稽首而君之尔。自是往杀舍。冬，仲孙何忌帅师伐邾娄。宋向巢帅师伐曹。",
        "七年春，宋皇瑗帅师侵郑。晋魏曼多帅师侵卫。夏，公会吴于**鄫**。秋，公伐邾娄。八月己酉，入邾娄，以**邾娄子益**来。**入不言伐**，此其言伐何？内辞也，**若使他人然**。邾娄子益何以名？绝。**曷为绝之？获也**。曷为不言其获？内大恶讳也。宋人围曹。冬，郑驷弘帅师救曹。",
        "八年春王正月，宋公入曹，以曹伯阳归。曹伯阳何以名？绝。曷为绝之？灭也。曷为不言其灭？讳**同姓**之灭也。何讳乎同姓之灭？力能救之而不救也。**吴伐我**。夏，齐人取**<imgalt=\"\"class=\"kindle-cn-inline-character\"src=\"Image00001.jpg\"/>**及<imgalt=\"\"class=\"kindle-cn-inline-character\"src=\"Image00052.jpg\"/>。取外邑不书，此何以书？所以赂齐也。曷为赂齐？为以邾娄子益来也。归邾娄子益于邾娄。秋七月。冬十有二月癸亥，杞伯过卒。齐人归<imgalt=\"\"class=\"kindle-cn-inline-character\"src=\"Image00001.jpg\"/>及<imgalt=\"\"class=\"kindle-cn-inline-character\"src=\"Image00052.jpg\"/>。",
        "九年春王二月，葬杞僖公。宋皇瑗帅师取郑师于雍丘。其言取之何？易也。其易奈何？诈之也。夏，楚人伐陈。秋，宋公伐郑。冬十月。",
        "十年春王二月，邾娄子益来奔。公会吴伐齐。三月戊戌，**齐侯阳生**卒。夏，宋人伐郑。晋赵鞅帅师侵齐。五月，公至自伐齐。葬齐悼公。卫公孟<imgalt=\"\"class=\"kindle-cn-inline-character\"src=\"Image00009.jpg\"/>自齐归于卫。**薛伯寅**卒。秋，葬薛惠公。冬，楚公子结帅师伐陈。**吴救陈**。",
        "十有一年春，齐国书帅师伐我。夏，陈**袁颇**出奔郑。五月，公会吴伐齐。甲戌，齐国书帅师及吴战于**艾陵**。齐师败绩，获齐国书。秋七月辛酉，**滕子虞母**卒。冬十有一月，葬滕隐公。卫**世叔齐**出奔宋。",
        "十有二年春，用田赋。何以书？讥。何讥尔？讥始用田赋也。夏五月甲辰，**孟子**卒。孟子者何？昭公之夫人也。其称孟子何？**讳娶同姓**，盖吴女也。公会吴于**橐皋**。秋，公会**卫侯**、宋皇瑗于运。宋向巢帅师伐郑。冬十有二月，<imgalt=\"\"class=\"kindle-cn-inline-character\"src=\"Image00015.jpg\"/>。何以书？记异也。**何异尔？不时也**。",
        "十有三年春，郑轩达帅师取宋师于嵒。其言取之何？易也。其易奈何？**诈反也**。夏，**许男戌**卒。公会晋侯及**吴子**于黄池。吴何以称子？**吴主会也**。吴主会，则曷为先言晋侯？不与夷狄之主中国也。**其言及吴子何**？**会两伯之辞**也。不与夷狄之主中国，则曷为以会两伯之辞言之？重吴也。曷为重吴？吴在是，则**天下诸侯莫敢不至**也。楚公子申帅师伐陈。於越入吴。",
        "秋，公至自会。晋魏多帅师侵卫。此晋魏曼多也，曷为谓之晋魏多？讥二名，二名非礼也。葬许元公。九月，<imgalt=\"\"class=\"kindle-cn-inline-character\"src=\"Image00015.jpg\"/>。久十有一月，有星孛于东方。孛者何？彗星也。**其言于东方何？见于旦也**。何以书？记异也。盗杀陈**夏<imgalt=\"\"class=\"kindle-cn-inline-character3\"src=\"Image00009.jpg\"/>夫**。十有二月，<imgalt=\"\"class=\"kindle-cn-inline-character\"src=\"Image00015.jpg\"/>。",
        "十有四年春，西狩获麟。何以书？记异也。何异尔？**非中国之兽也**。然则孰狩之？**薪采者也**。薪采者则微者也，曷为以狩言之？大之也。曷为大之？为获麟大之也。曷为为获麟大之？**麟者，仁兽也**，**有王者则至，无王者则不至**。有以告者曰：“有**麕**而角者。”孔子曰：“孰为来者！孰为来者！”反袂拭面，涕沾袍。**颜渊死**，**子曰**：“噫，天丧予！”**子路死**，子曰：“天**祝**予！”**西狩获麟，孔子曰**：“吾道穷矣！”。",
        "《春秋》何以始乎隐？祖之所逮闻也。所见异辞，所闻异辞，所传闻异辞。何以终乎哀十四年？曰：**备矣**。**君子**曷为为《春秋》？**拨乱世反诸正，莫近诸《春秋》**。则未知其为是与，其诸君子乐道尧舜之道与。末不亦乐乎尧舜之知君子也，制《春秋》之义以俟后圣，以君子之为亦有乐乎此也。"
    ],
    "notes": [
        {
            "陈侯": "陈闵公。随侯：随称侯仅此一见。据1.5.4“大国称侯，小国称伯子男”，随为姬姓小国，此时实为楚之附庸国，见5.20.3注",
            "。《解诂》释其称侯之因曰": "“随，微国，称侯者，本爵俱侯，土地见侵削，故微尔。”可见侯是其始封时之爵。许男：许元公。11.6.1载郑“灭许，以许男斯归”，是许曾为郑灭。《解诂》：“今戌（许元公之名）复见者，自复。”《通义》：“何氏必知许自复者，令诸侯复之，当有不与专封文。”许何时复国，戌何时即位，经皆不书，故不能确知。",
            "夏四月辛巳，郊": "《通义》：“亦以改卜牛故。三月下辛始卜郊，特此一卜得吉尔。”《穀梁传》：“夏四月郊，不时也。”“我以十二月下辛，卜正月上辛；如不从，则以正月下辛，卜二月上辛；如不从，则以二月下辛，卜三月上辛；如不从，则不郊矣。”",
            "齐侯、卫侯伐晋": "据《左传》，为“救范氏也”。"
        },
        {
            "漷东田及沂西田": "王献唐《三邾疆邑图考》：“所谓沂西田，指沂水以西之田；漷东田，指漷水以东之田。……漷东田不能于邾北鲁南求之，沂西田亦不能于邾北鲁南求之。二田相距必不甚远，且皆为邾地，就二水之东西，求两田之近处，殆在邹县东境偏北一带乎？沂经其东，其水西之田，即沂西田；漷水源出于此西北流，其水东之田，即漷东田。证以今地，田黄一带，则沂西田也；仙桥庄一带，则漷东田也。”据《左传》，鲁三卿本伐邾娄之绞邑（绞在今山东滕县东鄙，与鲁接壤），因绞邑土地肥沃，邾娄人遂赂以漷东田及沂西田，盟于",
            "句绎": "王献唐《三邾疆邑图考》：“句绎为小邾疆邑，邾与小邾谊气相关，国境交错，可假地小邾为盟，盟不必尽在本国境也。其地当在小邾之东北境，与邾鲁交界处，今滕县东北武城乡一带也。”《左传》杜注云：“句绎，邾地。”与十四年《左传》经文“小邾射以句绎来奔”矛盾，误。《穀梁传》：“三人伐而二人盟，何也？各盟其得也。”范宁集解：“季孙不得田，故不与盟。”《左传》孔疏则引服虔云：“季孙尊卿，敌服先归，使二子与之盟。”与《穀梁传》异。",
            "卫侯元": "即卫灵公，名元，公元前534—前493年在位。",
            "戚": "卫国地名，见6.1.1注。",
            "父有子，子不得有父也": "《解诂》：“明父得有子而废之，子不得有父之所有，故夺其国文，正其义也。”《通义》的解释与之稍异：“以蒯聩对辄言之，固父也，虽若得有其子之国；以蒯聩对灵公言之，则子也，灵公不以卫与蒯溃，即蒯聩不得而有卫也。”参下12.3.1。",
            "及郑轩达帅师战于栗": "阮元《公羊注疏校勘记》：“疏本作‘及郑轩达战于铁’。《解》云：‘诸家之经，轩达下有帅师，唯服引经者无。于铁者三家同有作栗字者，误也。今定本作栗字。’按‘郑轩达’下不言‘帅师’者，蒙上‘晋赵鞅帅师’也，今三家下有‘帅师’，当衍。疏本与服氏无之，是也。疏又谓三家同作‘战于铁’，定本作‘栗’者误。而《释文》同定本作‘栗’，区别之云：‘二传作铁。’案陆德明所据之本，不及疏本也。”据此，译文从阮校。杜预注《左传》云：“铁在戚城南。”则亦在今河南濮阳附近。",
            "州来": "见10.13.2注。州来为吴所灭，此时蔡为楚所迫，请迁于吴，吴以州来与之，故州来遂名下蔡。",
            "蔡杀其大夫公子驷": "据《左传》，蔡昭公欲迁于州来，吴师已至，“蔡侯告大夫，杀公子驷以说”。是公子驷是大夫中对迁徙持反对意见者的代表。"
        },
        {
            "石曼姑": "卫国的卿。围戚：因蒯聩在戚。《穀梁传》：“此卫事也，其先国夏何也？子不围父也。不系戚于卫者，子不有父也。”“子不围父”的子指辄，“子不有父”的子指蒯聩。",
            "伯讨": "见5.4.3注。因为卫国君位之争牵涉到祖孙三代的关系，《春秋》是不支持蒯聩的，所以《公羊传》用“伯讨”来解释《春秋》把“齐国夏”写在“卫石曼姑”的前面。",
            "辄": "蒯聩之子，卫灵公的嫡孙，即卫出公。据《左传》，卫灵公废逐太子蒯聩以后，有意立庶子公子郢（字子南）。卫灵公死后，公子郢辞让不立，才立了蒯聩之子辄。与《公羊传》“曼姑受命乎灵公而立辄”义异。但周代的制度，传位给嫡子，如嫡子不存，则传位给嫡孙。从这个意义上说，卫灵公废了蒯聩，则立辄也可以说是他的遗命。",
            "距": "通拒。指抵拒蒯聩回来争国。",
            "灵公逐蒯聩": "见11.14.2注。",
            "辞": "不接受。王父：祖父。",
            "是父之行乎子也": "《解诂》：“是灵公命行乎蒯聩。”",
            "王事": "公事，指周王的制度。",
            "是上之行乎下也": "《解诂》：“是王法行于诸侯。”《论语·述而》曾记载孔子对这件事的看法，可与《春秋》参看。“冉有曰：‘夫子为卫君乎？’（何晏集解：“郑曰：为犹助也，卫君者谓辄也。”）子贡曰：‘诺，吾将问之。’入曰：‘伯夷、叔齐何人也？’曰：‘古之贤人也。’曰：‘怨乎？’曰：‘求仁而得仁，又何怨？’出曰：‘夫子不为也。’（集解：“郑曰：父子争国，恶行。孔子以伯夷、叔齐为贤且仁，故知不助卫君明矣。”）”可见孔子也并不认为辄听祖父之命与父争国是“贤且仁”的。《通义》：“辄之道虽当让，而卫人奉辄自不失尊王父之意。若夫《论语》所言贤者之至行，又乌足以责辄也。”用今天的话来说，卫人立辄，是个法律问题；而辄不像伯夷、叔齐那样让国，则是个道德问题。"
        },
        {
            "毁庙": "见6.2.3注",
            "。《解诂》": "“礼，亲过高祖则毁其庙。”桓公至哀公已十一世，僖公至哀公也已八世，都已早应毁庙。",
            "《春秋》见者不复见也": "《通义》：“《春秋》之大法，凡主讥者有所托见，则不复特见。一省其文，一微其义。若然，经有‘有事于武宫’，复言‘立武宫’者，武公不在《春秋》中，嫌本有武世室，其为庙毁复立未明，故特见也。”",
            "敌也": "《通义》：“自义率祖，则太庙而外其尊同；自仁率亲，则高祖而上其疏等：故言敌也。”《穀梁传》：“言及，则祖有尊卑，由我言之则一也。”",
            "开阳": "《左传》、《穀梁传》作启阳。案开为《公羊传》避汉景帝讳而改。",
            "蔡人": "指蔡国的执政大夫，称人为贬。《解诂》：“称人者，恶大夫骄蹇作威，相放，当诛，故贬。”公孙猎：据《左传》杜注说是公子驷之党。",
            "秦伯": "秦惠公，公元前500—前492年在位。"
        },
        {
            "三月": "《左传》、《穀梁传》作二月。三月无庚戌，作二月者是。",
            "弑": "此据唐石经。《穀梁传》同，《左传》作杀。蔡侯申：即蔡昭公，名申，公元前518—前491年在位。",
            "弑君贱者穷诸人": "见6.16.2“大夫弑君称名氏，贱者穷诸人”。",
            "谓罪人也": "《公羊》之说，与《左传》、《穀梁传》皆异。《左传》叙杀蔡昭公者为“恐其又迁”的诸大夫。《穀梁传》则云：“《春秋》有三盗：微杀大夫，谓之盗；非所取而取之，谓之盗；辟中国之正道以袭利，谓之盗。”第一种情况如12.13.2的“盗杀陈夏<imgalt=\"\"class=\"kindle-cn-inline-character3\"src=\"Image00009.jpg\"/>夫”；第二种情况如11.8.2的“盗窃宝玉、大弓”，这里说的“盗弑蔡侯申”是第三种情况。故范宁集解云：“即杀蔡侯申者是非微者也”，与《公羊》义异。",
            "公孙辰": "据《左传》，为杀蔡昭公之党。",
            "公孙归姓、公孙霍": "据《左传》，亦为杀蔡昭公之党，《通义》：“《左氏》以为皆弑君之党，然经不以讨贼之辞言之，则彼未足信。”",
            "晋人执戎曼子赤归于楚": "据《左传》，楚围蛮氏（即戎曼子），蛮子赤奔晋，晋国不敢得罪楚，遂以诈执蛮子赤而畀楚。",
            "伯晋而京师楚": "伯与京师皆“名词”作“以动词”用，犹言以晋为伯而以楚为京师。"
        },
        {
            "蒲社": "《左传》、《穀梁传》作亳社。蒲社即《礼记·郊特牲》之“薄社”，《释文》：“薄，本又作亳。”《礼记·郊特牲》疏：“殷始都薄，故呼其社为薄社也。”古代建国时必先立社，以祭祀地神。周灭殷后，薄社即成为",
            "亡国之社": "《解诂》：“蒲社者，先世之亡国，在鲁境。”以为先时别有蒲国者，不知蒲即亳，误。《穀梁传》：“亳社者，亳之社也。亳，亡国也。”范宁集解：“亳即殷也，殷都于亳，故因谓之亳社。”",
            "社者封也": "古代立社，堆土为之。封，即堆土。《书·禹贡》：“厥贡惟土五色。”孔安国传：“王者封五色土为社，建诸侯，则各割其方色土与之，使立社。”",
            "揜其上而柴其下": "古代立社，为了使它能够通天，都是露天的。亡国之社则筑屋掩盖其上，使它不能通天，所以说“揜其上”，揜，即掩。《礼记·郊特牲》：“天子大社，必受霜露风雨，以达天地之气也。是故丧国之社屋之，不受天阳也。”柴其下则指亡国之社的下部以散木阻拦，使不通四方。《解诂》：“揜、柴之者，绝不得使通天地四方，以为有国者戒。”",
            "滕子结": "即滕顷公，名结，公元前513—前491年在位。",
            "葬蔡昭公": "《通义》：“书葬，明贼已讨。不见讨文者，盗贱不足录也。”"
        },
        {
            "比": "《左传》、《穀梁传》作毗，通假字。鲁国地名，确址不详。",
            "齐侯处臼": "《左传》、《穀梁传》作齐侯杵臼，通假字。即齐景公，名处臼，公元前547—前490年在位。",
            "丧以闰数": "《通义》：“礼，丧服以年为节者，不数闰；以月为节者，数闰。五月而葬，亦事之以月数者，故同得计闰。”",
            "略": "减省。"
        },
        {
            "葭": "《左传》、《穀梁传》作瑕，通假字。本邾娄国地名，此时为鲁邑。王献唐《三邾疆邑图考》：“案即今济宁邾瑕乡一带也。地为邾邑，与邿相近，为鲁所取，因为邾地，于瑕上加邾为邾瑕，后又谓之邾瑕城邾瑕乡。”《解诂》：“城者，取之也。不言取者，鲁数围取邾娄邑，邾娄未曾加非于鲁，而侮夺之不知足，有夷狄之行，故讳之，明恶甚。”",
            "齐国夏及高张来奔": "齐景公死后，国内政局不稳，国、高二卿奉景公遗命立舍（《左传》、《穀梁传》作荼，古音同可通）为君，舍为景公幼子，景公宠妾鬻姒所生，年小，时号晏孺子；陈乞则谋立公子阳生。陈乞的第一步就是联合其他大夫共攻国、高，国、高不敌，遂奔鲁。",
            "柤": "见9.10.1注。此时柤或已从楚国所有转为吴国所有。"
        },
        {
            "楚子轸": "即楚昭王，名轸（《史记·楚世家》及《年表》作珍），公元前515—前489年在位。",
            "阳生": "即后来的齐悼公，齐景公之子。",
            "陈乞": "谥僖，史又称陈僖子，《史记》作田乞、田釐子。舍：见12.6.1注。",
            "弑而立者，不以当国之辞言之": "《通义》：“弑而立者，谓继弑君而立者。若宋督弑殇公而立庄公，未尝言‘宋冯入于宋’；赵盾弑灵公而立景公，未尝言‘晋黑臀入于晋’之类是也。”",
            "此其以当国之辞言之何": "《通义》：“谓阳生不氏公子。”",
            "谖": "欺诈。《通义》：“冯、黑臀等皆君弑而后复国，此则先复国乃以谖弑舍，故特为篡辞。与齐小白入于齐而后杀纠者同罪。”参见3.9.2“齐小白入于齐。曷为以国氏？当国也。其言入何？篡辞也。”",
            "则臣请立之": "这是陈乞的策略。《解诂》：“陈乞欲拒言不可，恐景公杀阳生。”",
            "废正而立不正": "正指阳生，不正指舍。《穀梁传》：“阳生入而弑其君，以陈乞主之何也？不以阳生君荼（即舍）也。其不以阳生君荼何也？阳生正，荼不正。不正则其曰君何也？荼虽不正，已受命矣。”",
            "玉节": "玉制的符节。古代使者持节作为自己身份的凭证。陈乞给阳生玉节，是使他出齐国时可顺利通过沿途关口稽查，到达鲁国。",
            "于诸": "《解诂》：“置也，齐人语也。”",
            "除景公之丧": "指景公死后周年除去丧礼之服。《礼记·丧服小记》：“故期而祭，礼也；期而除丧，道也。”期即一周年。",
            "常之母": "陈乞指自己的妻子。常即陈恒（《史记》作田常，避汉文帝讳），陈乞之子，谥成，史又称陈成子或田成子。鱼菽之祭：宴请的谦辞。《解诂》：“言鱼豆者，示薄陋无所有。”《通义》：“牲用鱼，荐用菽，家之小祭祀。”",
            "化": "《通义》：“不将礼而相过曰化。”",
            "中霤": "室的中央。",
            "色然": "《解诂》：“惊骇貌。”",
            "闯然": "《解诂》：“闯，出头貌。”"
        },
        {
            "魏曼多": "谥襄，史又称魏襄子。",
            "鄫": "见5.14.2注。",
            "邾娄子益": "即邾娄隐公，名益，公元前506—前485年在位。",
            "入不言伐": "参见3.10.1“战不言伐，围不言战，入不言围，灭不言入：书其重者也。”",
            "若使他人然": "《通义》：“若公伐既归而使他人入之者然。讳不欲公首其恶。”",
            "曷为绝之？获也": "儒家认为国君要与社稷共存亡，国在则君在，国不在则君死之，国君被俘获是极其可耻的事。《穀梁传》：“益之名，恶也。”范宁集解：“恶其不能死社稷。”"
        },
        {
            "曹伯阳": "曹国末代之君，名阳，因国灭无谥，公元前501—前487年在位。",
            "同姓": "指鲁、曹皆姬姓之国。",
            "吴伐我": "《通义》：“不言鄙者，近逼城下之辞。”",
            "<imgalt=\"\"class=\"kindle-cn-inline-character\"src=\"Image00001.jpg\"/>": "见2.3.3注",
            "。<imgalt=\"\"class=\"kindle-cn-inline-character\"src=\"Image00052.jpg\"/>": "《左传》、《穀梁传》作阐，通假字。鲁国地名，在今山东宁阳西北。",
            "为以邾娄子益来也": "《解诂》：“邾娄，齐与国，畏为齐所怒，而赂之。”《左传》则云，齐悼公将娶季康子之妹，季康子之叔父季鲂侯与其妹私通，季康子不敢嫁妹，齐悼公怒而伐鲁，取<imgalt=\"\"class=\"kindle-cn-inline-character\"src=\"Image00001.jpg\"/>及阐。与《公羊传》义异。",
            "杞伯过": "即杞僖公，名过，公元前505—前487年在位。",
            "齐人归<imgalt=\"\"class=\"kindle-cn-inline-character\"src=\"Image00001.jpg\"/>及<imgalt=\"\"class=\"kindle-cn-inline-character\"src=\"Image00052.jpg\"/>": "《通义》：“既归邾娄子，齐亦还所赂。”《左传》则说，齐悼公还是把季康子妹季姬迎了回去，而且宠爱她。归还<imgalt=\"\"class=\"kindle-cn-inline-character\"src=\"Image00001.jpg\"/>与阐，是“季姬嬖故也”。与《公羊传》义异。"
        },
        {
            "雍丘": "原为杞国的始封地，杞国东迁后，地为宋国所得，在今河南杞县。据《左传》，郑师围宋雍丘而未下，宋皇瑗帅师围郑军，用“每日迁舍”的办法，在郑师外围筑堡垒挖壕沟，待“垒合”，郑师处于内外交困的形势之下，遂为宋师所取。《公羊传》说“易也”、“诈之也”，即指此，与《左传》合。"
        },
        {
            "邾娄子益来奔": "《通义》：“益反国，仍为无道，见逐于吴，故出。”",
            "齐侯阳生": "即齐悼公，名阳生，公元前488—前485年在位。据《左传》，悼公为齐人所杀。",
            "薛伯寅": "即薛惠公，名寅，公元前496—前485年在位。",
            "吴救陈": "据《左传》，知吴国带领军队的是季子。此处不称其名，也不称人，而单称国名吴，根据3.10.4“国不若氏，氏不若人，人不若名，名不若字”的说法，仍表示一种贬意。《通义》引何焯曰：“救中国不进者，吴楚结憾，志不在救中国，故不进。”"
        },
        {
            "国书": "国夏（11.4.1注）之子，袭父为齐卿。",
            "袁颇": "《左传》、《穀梁传》作辕颇，字通。袁涛涂（5.4.3注）的后代，陈国的司徒。据《左传》，袁颇以嫁陈闵公之女为名义敛取赋税，从中贪污，故为国人所逐。",
            "艾陵": "齐国地名，在今山东莱芜东北。",
            "滕子虞母": "即滕隐公，名虞母，公元前490—前484年在位。",
            "世叔齐": "《左传》传文称之为大叔疾，谥悼，又称大叔悼子。世叔申（10.32.1注）之子。据《左传》，因其私生活不合当时礼制与道德，耻而出奔。"
        },
        {
            "用田赋": "季康子对当时田赋的一种改革，使原来只在国家有武事时征收田赋，改为常年征收，加重了人民的负担。《国语·鲁语下》记孔子对冉有私下评论季康子此举时说：先王时“有军旅之出则征之，无则已”，可见季康子是不管有没有军旅之出，一律征之了。《通义》：“古者公田，籍而不税，有武事然后取其赋，故赋之字从贝从武。”“今鲁用田赋者，是无军旅之岁亦一切取之，厉民甚矣。”",
            "孟子": "鲁昭公的夫人，吴女。吴与鲁同为姬姓，周代强调同姓不婚，昭公娶同姓，是违反当时礼法的。《论语·述而》记陈司败（陈国大夫，司败为官名）问孔子：“昭公知礼乎？”孔子回答说“知礼”，被陈司败批评为：“吾闻君子不党，君子亦党乎！”他指出：“君（指昭公）娶于吴为同姓，谓之吴孟子。君而知礼，孰不知礼！”驳得孔子只好说：“丘也幸，苟有过，人必知之。”《通义》：“谓之吴孟子，犹言吴之长女，特避不称孟姬耳。杜预以为诡托宋姓者，非也。孟子者，贵母姊妹之称。《诗》曰‘齐子由归’可证也。”《礼记·坊记》：“《鲁春秋》犹去夫人之姓曰吴，其死曰‘孟子卒’。”可见未经孔子修订的《鲁春秋》中亦有“吴孟子”之称。",
            "讳娶同姓": "《礼记·曲礼上》：“取妻不取同姓，故买妾不知其姓则卜之。”《礼记·坊记》：“子云：‘取妻不取同姓，以厚别也。’故买妾不知其姓，则卜之。”",
            "橐皋": "吴国地名，在今安徽巢县西北。",
            "卫侯": "卫出公。运：《左传》、《穀梁传》作郧，同音通假。吴国地名，杜预注《左传》云，郧一名发阳，也即“广陵海陵县东南”的“发繇亭”，地在今江苏如皋东。",
            "何异尔？不时也": "《解诂》：“周十二月，夏之十月，不当见，故为异。”"
        },
        {
            "嵒": "据《左传》说是“宋、郑之间”的“隙地”，地当在今河南杞县、通许一带。郑、宋双方原取得谅解，互不占有此地。后郑城之，宋遂围嵒。郑轩达又围宋师，宋向魋救之，郑悬赏道：“得向魋者有赏。”向魋逃归，宋师遂败。《左传》所言仅如此。《公羊》所谓郑用诈或即指悬赏而言。",
            "诈反也": "指对12.9.1“宋皇瑗帅师取郑师于雍丘”用“诈”的回报。《解诂》：“前宋行诈取郑师，今郑复行诈取之，苟相报偿，不以君子正道，故传言诈反，反犹报也。”",
            "许男戌": "《左传》、《穀梁传》作许男成，盖传写之异。即许元公，名戌。《通义》：“失国复立。”公元前？—前482年在位。",
            "吴子": "吴王夫差。黄池：原为卫地，此时属宋，在今河南封丘西南，济水与黄沟交会处。",
            "吴主会也": "据《左传》，黄池之会，吴、晋争当盟主。“吴人曰：‘于周室，我为长（吴之先为周文王的大伯父太伯）。’晋人曰：‘于姬姓，我为伯。’”结果是“先晋人”，与《公羊传》有异。《公羊传》与《国语·吴语》“吴公先歃，晋侯亚之”合。",
            "其言及吴子何": "据8.15.3“曷为殊会吴？外吴也”而设问。",
            "会两伯之辞": "《解诂》：“晋序上者，主会文也；吴言‘及’者，亦人往为主之文也。方不与夷狄主中国，而又事实当见，不可醇夺，故张两伯辞，先晋，言及吴子，使若晋主会为伯，吴亦主会为伯，半抑半起，以夺见其事也。”",
            "天下诸侯莫敢不至": "《春秋》记黄池之会只鲁、晋、吴三国，《左传》谓周之卿士单平公亦与会，《公羊传》则谓天下诸侯皆至，《春秋》未尽书而已。《解诂》云：“时吴强而无道，败齐临菑，乘胜大会中国，齐晋前驱，鲁卫骖乘，滕薛侠毂而趋。”《通义》：“诸侯不序者，序在晋下则仍似外吴常辞，两伯不显；序在吴下，则是外吴而并外中国诸侯矣。文不可施，故一切削之，但张两伯辞，则诸侯皆在可知。”据《左传》，宋国未赴黄池之会，会后吴王夫差即欲伐之。则其他诸侯或确皆与会了。"
        },
        {
            "魏多": "《左传》、《穀梁传》作魏曼多。《史记·魏世家》《索隐》引《世本》云：“（魏）献子（荼）生简子取，取生襄子侈。”是魏襄子本名侈，为单名而非二名。《春秋》或作魏曼多（12.7.1），或作魏多，多即侈之假借字。",
            "其言于东方何？见于旦也": "《解诂》：“旦者，日方出时，宿不复见，故言东方（而不言宿）知为旦。”",
            "夏<imgalt=\"\"class=\"kindle-cn-inline-character3\"src=\"Image00009.jpg\"/>夫": "《左传》、《穀梁传》作夏区夫，通假字。陈国大夫。"
        },
        {
            "麟": "麒麟的简称，古代传说中的神兽，四灵之一。《礼记·礼运》：“何谓四灵？麟凤龟龙。”《尔雅·释兽》作麐，叙其状曰：“麕身，牛尾，一角。”陆玑《毛诗草木虫鱼疏》更详为描述：“麕身，牛尾，马足，黄色，圆蹄，一角，角端有肉。音中钟吕，行中规矩。”《史记·司马相如列传》《索隐》引张揖：“雄曰麒，雌曰麟。”别为一说。据《左传》，获麟的地点在大野，即今山东巨野，地在鲁之西境，故曰西狩。",
            "非中国之兽也": "中国，即国中。《通义》：“非鲁国中所有。”此句别有异文。阮元《公羊注疏校勘记》云：“《春秋左氏传·序》引孔舒元《公羊传》本作‘今麟非常之兽，其为非常之兽奈何？’与注本迥异。”",
            "薪采者也": "《左传》则云：“叔孙氏之车（御车者）子<imgalt=\"\"class=\"kindle-cn-inline-character\"src=\"Image00029.jpg\"/>商（子<imgalt=\"\"class=\"kindle-cn-inline-character\"src=\"Image00029.jpg\"/>为複姓）获麟。”与《公羊传》异。《通义》调和二说云：“叔孙氏之车子<imgalt=\"\"class=\"kindle-cn-inline-character\"src=\"Image00029.jpg\"/>商采薪于大野，获麟焉，折其前左足，载而归。”",
            "麟者，仁兽也": "陆玑《毛诗草木虫鱼疏》在上引文后又说：“游必择地，详而后处，不履生虫，不践生草，不群居，不侣行，不入陷井，不罹罗网，王者至仁则出。”《解诂》：麟“一角而戴肉，设武备而不为害，所以为仁也。”",
            "有王者则至，无王者则不至": "《礼记·礼运》云：圣王之时，“山出噐车，河出马图，凤凰麒麟，皆在郊棷。”《诗·周南·麟之趾》孔颖达疏：“案《中候握河纪》云：‘帝轩题象，麒麟在囿。’又《唐传》云：‘尧时，麒麟在郊薮。’又《孔丛》云：‘唐、虞之世，麟凤游于田。’由此言之，黄帝、尧、舜致麟矣。”又曰：“孔子之时所以致麟者，自为制作之应，非化洽所致，不可以难此也。”阮元《校勘记》云，孔舒元《公羊传》本在“有王者则至，无王者则不至”下有“然则孰为而至？为孔子之作《春秋》”二句，“今何注本此下无此二句”。",
            "麕": "即獐。《诗·召南·野有死麕》：“野有死麕，白茅包之。”",
            "颜渊死": "《史记·仲尼弟子列传》：“颜回者，鲁人也，字子渊，少孔子三十岁。”又云：“回年二十九，发尽白，蚤（早）死。”《索引》引《孔子家语》云：“三十二而死。”推其生年，晚于孔子三十，则为昭公十九年；推其死年，在哀公三年。",
            "子曰": "“噫，天丧予”：《论语·先进》：“颜渊死，子曰：‘噫，天丧予！天丧予！’”",
            "子路死": "《史记·仲尼弟子列传》：“仲由字子路，卞人也，少孔子九岁。”《左传·哀公十五年》记子路在卫乱中被蒯聩之党“以戈击之，断缨。子路曰：‘君子死，冠不免。’结缨而死”。则子路生于襄公三十年，死于哀公十五年。",
            "祝": "断。",
            "西狩获麟，孔子曰": "“吾道穷矣”：文亦见《史记·儒林列传》。"
        },
        {
            "祖之所逮闻也": "《通义》：“隐公以来之事，祖虽不及见，犹及闻而知之。过是以往，文献不足，恐失其实，故断自隐始。”",
            "所闻、所传闻": "《通义》：“所闻者，己之所逮闻也。至于祖之所逮闻，而父受之祖、己受之父，则所传闻也。”",
            "备矣": "《解诂》：“人道浃，王道备，必止于麟者，欲见拨乱功成于麟。”《通义》：“上治隐、桓，而贬、绝之法立；下录定、哀，而尊、亲之义著。君君、臣臣，父父、子子，夫夫、妇妇，采毫毛之善，讥纤芥之恶，凡所以示后王经制者，靡不具焉。天之大数，不过十二，因而十之，周而再之。天道浃于上，人事备于下。”",
            "君子": "指孔子。",
            "拨乱世反诸正，莫近诸《春秋》": "《通义》：“子曰：‘我欲托之空言，不如见之行事之深切著明也。’盖理不穷其变则不深，事不当其势则不切，高论尧舜之道而无成败之效，则不著不明。故近取诸春秋，因乱世之事，季俗之情，渐裁以正道，庶贤者易勉，不肖者易晓，亦致治太平之所由基也。”",
            "“末不亦乐乎”至“亦有乐乎此也”": "《通义》：“言君子岂不乐当世有圣帝如尧舜者知君子而用之也，既不可得，退修《春秋》，以俟后世王者复起，推明《春秋》之义以治天下，则亦君子之所乐也。”末，徐彦疏以为即指孔子：“孔子之道既与尧舜雅合，故得与尧舜相对为首末。然则指孔子言‘不亦’也。”"
        }
    ]
}