{
    "name": "史记_本 纪_高祖本纪第八",
    "explanation": "",
    "original_texts": [
        "高祖，沛丰邑中阳里人，姓刘氏，字季。父曰太公，母曰刘媪。其先刘媪尝息大泽之陂，梦与神遇。是时雷电晦冥，太公往视，则见蛟龙于其上。已而有身，遂产高祖。高祖为人，隆准而龙颜，美须髯，左股有七十二黑子。仁而爱人，喜施，意豁如也。常有大度，不事家人生产作业。及壮，试为吏，为泗水亭长，廷中吏无所不狎侮。好酒及色。常从王媪、武负贳酒，醉卧，武负、王媪见其上常有龙，怪之。高祖每酤留饮，酒仇数倍。及见怪，岁竟，此两家常折券弃责。高祖常繇咸阳，纵观，观秦皇帝，喟然太息曰：“嗟乎，大丈夫当如此也！”单父人吕公善沛令，避仇从之客，因家沛焉。沛中豪桀吏闻令有重客，皆往贺。萧何为主吏，主进，令诸大夫曰：“进不满千钱，坐之堂下。”高祖为亭长，素易诸吏，乃绐为谒曰“贺钱万”，实不持一钱。谒入，吕公大惊，起，迎之门。吕公者，好相人，见高祖状貌，因重敬之，引入坐。萧何曰：“刘季固多大言，少成事。”高祖因狎侮诸客，遂坐上坐，无所诎。酒阑，吕公因目固留高祖。高祖竟酒，后。吕公曰：“臣少好相人，相人多矣，无如季相，愿季自爱。臣有息女，愿为季箕帚妾。”酒罢，吕媪怒吕公曰：“公始常欲奇此女，与贵人。沛令善公，求之不与，何自妄许与刘季？”吕公曰：“此非儿女子所知也。”卒与刘季。吕公女乃吕后也，生孝惠帝、鲁元公主。高祖为亭长时，常告归之田。吕后与两子居田中耨，有一老父过请饮，吕后因哺之。老父相吕后曰：“夫人天下贵人。”令相两子，见孝惠，曰：“夫人所以贵者，乃此男也。”相鲁元，亦皆贵。老父已去，高祖适从旁舍来，吕后具言客有过，相我子母皆大贵。高祖问，曰：“未远。”乃追及，问老父。老父曰：“曩者夫人婴儿皆似君，君相贵不可言。”高祖乃谢曰：“诚如父言，不敢忘德。”及高祖贵，遂不知老父处。高祖为亭长，乃以竹皮为冠，令求盗之薛治之，时时冠之，及贵常冠，所谓“刘氏冠”乃是也。高祖以亭长为县送徒郦山，徒多道亡。自度比至皆亡之，到丰西泽中，止饮，夜乃解纵所送徒。曰：“公等皆去，吾亦从此逝矣！”徒中壮士愿从者十余人。高祖被酒，夜径泽中，令一人行前。行前者还报曰：“前有大蛇当径，愿还。”高祖醉，曰：“壮士行，何畏！”乃前，拔剑击斩蛇。蛇遂分为两，径开。行数里，醉，因卧。后人来至蛇所，有一老妪夜哭。人问何哭，妪曰：“人杀吾子，故哭之。”人曰：“妪子何为见杀？”妪曰：“吾子，白帝子也，化为蛇，当道，今为赤帝子斩之，故哭。”人乃以妪为不诚，欲告之，妪因忽不见。后人至，高祖觉。后人告高祖，高祖乃心独喜，自负。诸从者日益畏之。秦始皇帝常曰“东南有天子气”，于是因东游以厌之。高祖即自疑，亡匿，隐于芒、砀山泽岩石之间。吕后与人俱求，常得之。高祖怪问之。吕后曰：“季所居上常有云气，故从往常得季。”高祖心喜。沛中子弟或闻之，多欲附者矣。秦二世元年秋，陈胜等起蕲，至陈而王，号为“张楚”。诸郡县皆多杀其长吏以应陈涉。沛令恐，欲以沛应涉。掾、主吏萧何、曹参乃曰：“君为秦吏，今欲背之，率沛子弟，恐不听。愿君召诸亡在外者，可得数百人，因劫众，众不敢不听。”乃令樊哙召刘季。刘季之众已数十百人矣。于是樊哙从刘季来。沛令后悔，恐其有变，乃闭城城守，欲诛萧、曹。萧、曹恐，逾城保刘季。刘季乃书帛射城上，谓沛父老曰：“天下苦秦久矣。今父老虽为沛令守，诸侯并起，今屠沛。沛今共诛令，择子弟可立者立之，以应诸侯，则家室完。不然，父子俱屠，无为也。”父老乃率子弟共杀沛令，开城门迎刘季，欲以为沛令。刘季曰：“天下方扰，诸侯并起，今置将不善，壹败涂地。吾非敢自爱，恐能薄，不能完父兄子弟。此大事，愿更相推择可者。”萧、曹等皆文吏，自爱，恐事不就，后秦种族其家，尽让刘季。诸父老皆曰：“平生所闻刘季诸珍怪，当贵，且卜筮之，莫如刘季最吉。”于是刘季数让。众莫敢为，乃立季为沛公。祠黄帝，祭蚩尤于沛庭，而衅鼓旗，帜皆赤。由所杀蛇白帝子，杀者赤帝子，故上赤。于是少年豪吏如萧、曹、樊哙等皆为收沛子弟二三千人，攻胡陵、方与，还守丰。秦二世二年，陈涉之将周章军西至戏而还。燕、赵、齐、魏皆自立为王。项氏起吴。秦泗川监平将兵围丰，二日，出与战，破之。命雍齿守丰，引兵之薛。泗川守壮败于薛，走至戚，沛公左司马得泗川守壮，杀之。沛公还军亢父，至方与，周市来功方与，未战。陈王使魏人周巿略地。周市使人谓雍齿曰：“丰，故梁徙也。今魏地已定者数十城。齿今下魏，魏以齿为侯守丰。不下，且屠丰。”雍齿雅不欲属沛公，及魏招之，即反为魏守丰。沛公引兵攻丰，不能取。沛公病，还之沛。沛公怨雍齿与丰子弟叛之，闻东阳宁君、秦嘉立景驹为假王，在留，乃往从之，欲请兵以攻丰。是时秦将章邯从陈，别将司马仁将兵北定楚地，屠相，至砀。东阳宁君、沛公引兵西，与战萧西，不利。还收兵聚留，引兵攻砀，三日乃取砀。因收砀兵，得五六千人。攻下邑，拔之。还军丰。闻项梁在薛，从骑百余往见之。项梁益沛公卒五千人，五大夫将十人。沛公还，引兵攻丰。从项梁月余，项羽已拔襄城还。项梁尽召别将居薛。闻陈王定死，因立楚后怀王孙心为楚王，治盱台。项梁号武信君。居数月，北攻亢父，救东阿，破秦军。齐军归，楚独追北，使沛公、项羽别攻城阳，屠之。军濮阳之东，与秦军战，破之。秦军复振，守濮阳，环水。楚军去而攻定陶，定陶未下。沛公与项羽西略地至雍丘之下，与秦军战，大破之，斩李由。还攻外黄，外黄未下。项梁再破秦军，有骄色。宋义谏，不听。秦益章邯兵，夜衔枚击项梁，大破之定陶，项梁死。沛公与项羽方攻陈留，闻项梁死，引兵与吕将军俱东。吕臣军彭城东，项羽军彭城西，沛公军砀。章邯已破项梁军，则以为楚地兵不足忧，乃渡河，北击赵，大破之。当是之时，赵歇为王，秦将王离围之巨鹿城，此所谓河北之军也。秦二世三年，楚怀王见项梁军破，恐，徙盱台都彭城，并吕臣、项羽军自将之。以沛公为砀郡长，封为武安侯，将砀郡兵。封项羽为长安侯，号为鲁公。吕臣为司徒，其父吕青为令尹。赵数请救，怀王乃以宋义为上将军，项羽为次将，范增为末将，北救赵。令沛公西略地入关。与诸将约，先入定关中者王之。当是时，秦兵强，常乘胜逐北，诸将莫利先入关。独项羽怨秦破项梁军，奋，愿与沛公西入关。怀王诸老将皆曰：“项羽为人僄悍猾贼。项羽尝攻襄城，襄城无遗类，皆坑之，诸所过无不残灭。且楚数进取，前陈王、项梁皆败。不如更遣长者扶义而西，告谕秦父兄。秦父兄苦其主久矣，今诚得长者往，毋侵暴，宜可下。项羽僄悍，今不可遣。独沛公素宽大长者，可遣。”卒不许项羽，而遣沛公西略地，收陈王、项梁散卒。乃道砀至成阳，与杠里秦军夹壁，破二军。楚军出兵击王离，大破之。沛公引兵西，遇彭越昌邑，因与俱攻秦军，战不利。还至栗，遇刚武侯，夺其军，可四千余人，并之。与魏将皇欣、魏申徒武蒲之军并攻昌邑，昌邑未拔。西过高阳。郦食其监门，曰：“诸将过此者多，吾视沛公大人长者。”乃求见说沛公。沛公方踞床，使两女子洗足。郦生不拜，长揖，曰：“足下必欲诛无道秦，不宜踞见长者。”于是沛公起，摄衣谢之，延上坐。食其说沛公袭陈留，得秦积粟。乃以郦食其为广野君，郦商为将，将陈留兵，与偕攻开封，开封未拔。西与秦将杨熊战白马，又战曲遇东，大破之。杨熊走之荥阳，二世使使者斩以徇。南攻颍阳，屠之。因张良遂略韩地轘辕。当是时，赵别将司马卬方欲渡河入关，沛公乃北攻平阴，绝河津。南，战洛阳东，军不利，还至阳城，收军中马骑，与南阳守齮战犨东，破之。略南阳郡，南阳守齮走，保城守宛。沛公引兵过而西。张良谏曰：“沛公虽欲急入关，秦兵尚众，距险。今不下宛，宛从后击，强秦在前，此危道也。”于是沛公乃夜引兵从他道还，更旗帜，黎明，围宛城三匝。南阳守欲自刭。其舍人陈恢曰：“死未晚也。”乃逾城见沛公，曰：“臣闻足下约，先入咸阳者王之。今足下留守宛。宛，大郡之都也，连城数十，人民众，积蓄多，吏人自以为降必死，故皆坚守乘城。今足下尽日止攻，士死伤者必多；引兵去宛，宛必随足下后：足下前则失咸阳之约，后又有强宛之患。为足下计，莫若约降，封其守，因使止守，引其甲卒与之西。诸城未下者，闻声争开门而待，足下通行无所累。”沛公曰：“善。”乃以宛守为殷侯，封陈恢千户。引兵西，无不下者。至丹水，高武侯鳃、襄侯王陵降西陵。还攻胡阳，遇番君别将梅鋗，与皆，降析、郦。遣魏人宁昌使秦，使者未来。是时章邯已以军降项羽于赵矣。初，项羽与宋义北救赵，及项羽杀宋义，代为上将军，诸将黥布皆属，破秦将王离军，降章邯，诸侯皆附。及赵高已杀二世，使人来，欲约分王关中。沛公以为诈，乃用张良计，使郦生、陆贾往说秦将，啖以利，因袭攻武关，破之。又与秦军战于蓝田南，益张疑兵旗帜，诸所过毋得掠卤，秦人憙，秦军解，因大破之。又战其北，大破之。乘胜，遂破之。汉元年十月，沛公兵遂先诸侯至霸上。秦王子婴素车白马，系颈以组，封皇帝玺、符、节，降轵道旁。诸将或言诛秦王。沛公曰：“始怀王遣我，固以能宽容；且人已服降，又杀之，不祥。”乃以秦王属吏，遂西入咸阳。欲止宫休舍，樊哙、张良谏，乃封秦重宝财物府库，还军霸上。召诸县父老豪桀曰：“父老苦秦苛法久矣，诽谤者族，偶语者弃市。吾与诸侯约，先入关者王之，吾当王关中。与父老约，法三章耳：杀人者死，伤人及盗抵罪。余悉除去秦法。诸吏人皆案堵如故。凡吾所以来，为父老除害，非有所侵暴，无恐！且吾所以还军霸上，待诸侯至而定约束耳。”乃使人与秦吏行县乡邑，告谕之。秦人大喜，争持牛羊酒食献飨军士。沛公又让不受，曰：“仓粟多，非乏，不欲费人。”人又益喜，唯恐沛公不为秦王。或说沛公曰：“秦富十倍天下，地形强。今闻章邯降项羽，项羽乃号为雍王，王关中。今则来，沛公恐不得有此。可急使兵守函谷关，无内诸侯军，稍征关中兵以自益，距之。”沛公然其计，从之。十一月中，项羽果率诸侯兵西，欲入关，关门闭。闻沛公已定关中，大怒，使黥布等攻破函谷关。十二月中，遂至戏。沛公左司马曹无伤闻项王怒，欲攻沛公，使人言项羽曰：“沛公欲王关中，令子婴为相，珍宝尽有之。”欲以求封。亚父劝项羽击沛公。方飨士，旦日合战。是时项羽兵四十万，号百万。沛公兵十万，号二十万，力不敌。会项伯欲活张良，夜往见良，因以文谕项羽，项羽乃止。沛公从百余骑，驱之鸿门，见谢项羽。项羽曰：“此沛公左司马曹无伤言之。不然，籍何以生此！”沛公以樊哙、张良故，得解归。归，立诛曹无伤。项羽遂西，屠烧咸阳秦宫室，所过无不残破。秦人大失望，然恐，不敢不服耳。项羽使人还报怀王。怀王曰：“如约。”项羽怨怀王不肯令与沛公俱西入关，而北救赵，后天下约。乃曰：“怀王者，吾家项梁所立耳，非有功伐，何以得主约！本定天下，诸将及籍也。”乃佯尊怀王为义帝，实不用其命。正月，项羽自立为西楚霸王，王梁、楚地九郡，都彭城。负约，更立沛公为汉王，王巴、蜀、汉中，都南郑。三分关中，立秦三将：章邯为雍王，都废丘；司马欣为塞王，都栎阳；董翳为翟王，都高奴。楚将瑕丘申阳为河南王，都洛阳。赵将司马卬为殷王，都朝歌。赵王歇徙王代。赵相张耳为常山王，都襄国。当阳君黥布为九江王，都六。怀王柱国共敖为临江王，都江陵。番君吴芮为衡山王，都邾。燕将臧荼为燕王，都蓟。故燕王韩广徙王辽东。广不听，臧荼攻杀之无终。封成安君陈余河间三县，居南皮。封梅鋗十万户。四月，兵罢戏下，诸侯各就国。汉王之国，项王使卒三万人从，楚与诸侯之慕从者数万人，从杜南入蚀中。去辄烧绝栈道，以备诸侯盗兵袭之，亦示项羽无东意。至南郑，诸将及士卒多道亡归，士卒皆歌思东归。韩信说汉王曰：“项羽王诸将之有功者，而王独居南郑，是迁也。军吏士卒皆山东之人也，日夜跂而望归，及其锋而用之，可以有大功。天下已定，人皆自宁，不可复用。不如决策东乡，争权天下。”项羽出关，使人徙义帝。曰：“古之帝者地方千里，必居上游。”乃使使徙义帝长沙郴县，趣义帝行，群臣稍倍叛之，乃阴令衡山王、临江王击之，杀义帝江南。项羽怨田荣，立齐将田都为齐王。田荣怒，因自立为齐王，杀田都而反楚；予彭越将军印，令反梁地。楚令萧公角击彭越，彭越大破之。陈余怨项羽之弗王己也，令夏说说田荣，请兵击张耳。齐予陈余兵，击破常山王张耳，张耳亡归汉。迎赵王歇于代，复立为赵王。赵王因立陈余为代王。项羽大怒，北击齐。八月，汉王用韩信之计，从故道还，袭雍王章邯。邯迎击汉陈仓，雍兵败，还走；止战好畤，又复败，走废丘。汉王遂定雍地。东至咸阳，引兵围雍王废丘，而遣诸将略定陇西、北地、上郡。令将军薛欧、王吸出武关，因王陵兵南阳，以迎太公、吕后于沛。楚闻之，发兵距之阳夏，不得前。令故吴令郑昌为韩王，距汉兵。二年，汉王东略地，塞王欣、翟王翳、河南王申阳皆降。韩王昌不听，使韩信击破之。于是置陇西、北地、上郡、渭南、河上、中地郡；关外置河南郡。更立韩太尉信为韩王。诸将以万人若以一郡降者，封万户。缮治河上塞。诸故秦苑囿园池，皆令人得田之，正月，虏雍王弟章平。大赦罪人。汉王之出关至陕，抚关外父老，还，张耳来见，汉王厚遇之。二月，令除秦社稷，更立汉社稷。三月，汉王从临晋渡，魏王豹将兵从。下河内，虏殷王，置河内郡。南渡平阴津，至洛阳。新城三老董公遮说汉王以义帝死故。汉王闻之，袒而大哭。遂为义帝发丧，临三日。发使者告诸侯曰：“天下共立义帝，北面事之。今项羽放杀义帝于江南，大逆无道。寡人亲为发丧，诸侯皆缟素。悉发关内兵，收三河士，南浮江汉以下，愿从诸侯王击楚之杀义帝者。”是时项王北击齐，田荣与战城阳。田荣败，走平原，平原民杀之。齐皆降楚。楚因焚烧其城郭，系虏其子女。齐人叛之。田荣弟横立荣子广为齐王，齐王反楚城阳。项羽虽闻汉东，既已连齐兵，欲遂破之而击汉。汉王以故得劫五诸侯兵，遂入彭城。项羽闻之，乃引兵去齐，从鲁出胡陵，至萧，与汉大战彭城灵壁东睢水上，大破汉军，多杀士卒，睢水为之不流。乃取汉王父母妻子于沛，置之军中以为质。当是时，诸侯见楚强汉败，还皆去汉复为楚。塞王欣亡入楚。吕后兄周吕侯为汉将兵，居下邑。汉王从之，稍收士卒，军砀。汉王乃西过梁地，至虞。使谒者随何之九江王布所，曰：“公能令布举兵叛楚，项羽必留击之。得留数月，吾取天下必矣。”随何往说九江王布，布果背楚。楚使龙且往击之。汉王之败彭城而西行，使人求家室，家室亦亡，不相得。败后乃独得孝惠，六月，立为太子，大赦罪人。令太子守栎阳，诸侯子在关中者皆集栎阳为卫。引水灌废丘，废丘降，章邯自杀。更名废丘为槐里。于是令祠官祀天地四方上帝山川，以时祀之。兴关内卒乘塞。是时九江王布与龙且战，不胜，与随何间行归汉。汉王稍收士卒，与诸将及关中卒益出，是以兵大振荥阳，破楚京、索间。三年，魏王豹谒归视亲疾，至即绝河津，反为楚。汉王使郦生说豹，豹不听。汉王遣将军韩信击，大破之，虏豹。遂定魏地，置三郡，曰河东、太原、上党。汉王乃令张耳与韩信遂东下井陉击赵，斩陈余、赵王歇。其明年，立张耳为赵王。汉王军荥阳南，筑甬道属之河，以取敖仓。与项羽相距岁余。项羽数侵夺汉甬道，汉军乏食，遂围汉王。汉王请和，割荥阳以西者为汉。项王不听。汉王患之，乃用陈平之计，予陈平金四万斤，以间疏楚君臣。于是项羽乃疑亚父。亚父是时劝项羽遂下荥阳，及其见疑，乃怒，辞老，愿赐骸骨归卒伍，未至彭城而死。汉军绝食，乃夜出女子东门二千余人，被甲，楚因四面击之。将军纪信乃乘王驾，诈为汉王，诳楚，楚皆呼万岁，之城东观，以故汉王得与数十骑出西门遁。令御史大夫周苛、魏豹、枞公守荥阳。诸将卒不能从者，尽在城中。周苛、枞公相谓曰：“反国之王，难与守城。”因杀魏豹。汉王之出荥阳入关，收兵欲复东。袁生说汉王曰：“汉与楚相距荥阳数岁，汉常困。愿君王出武关，项羽必引兵南走，王深壁，令荥阳成皋间且得休。使韩信等辑河北赵地，连燕齐，君王乃复走荥阳，未晚也。如此，则楚所备者多，力分，汉得休，复与之战，破楚必矣。”汉王从其计，出军宛叶间，与黥布行收兵。项羽闻汉王在宛，果引兵南。汉王坚壁不与战。是时彭越渡睢水，与项声、薛公战下邳，彭越大破楚军。项羽乃引兵东击彭越。汉王亦引兵北军成皋。项羽已破走彭越，闻汉王复军成皋，乃复引兵西，拔荥阳，诛周苛、枞公，而虏韩王信，遂围成皋。汉王逃，独与滕公共车出成皋玉门，北渡河，驰宿修武。自称使者，晨驰入张耳、韩信壁，而夺之军。乃使张耳北益收兵赵地，使韩信东击齐。汉王得韩信军，则复振。引兵临河，南飨军小修武南，欲复战。郎中郑忠乃说止汉王，使高垒深堑，勿与战。汉王听其计，使卢绾、刘贾将卒二万人，骑数百，渡白马津，入楚地，与彭越复击破楚军燕郭西，遂复下梁地十余城。淮阴已受命东，未渡平原。汉王使郦生往说齐王田广，广叛楚，与汉和，共击项羽。韩信用蒯通计，遂袭破齐。齐王烹郦生，东走高密。项羽闻韩信已举河北兵破齐、赵，且欲击楚，则使龙且、周兰往击之。韩信与战，骑将灌婴击，大破楚军，杀龙且。齐王广奔彭越。当此时，彭越将兵居梁地，往来苦楚兵，绝其粮食。四年，项羽乃谓海春侯大司马曹咎曰：“谨守成皋。若汉挑战，慎勿与战，无令得东而已。我十五日必定梁地，复从将军。”乃行击陈留、外黄、睢阳，下之。汉果数挑楚军，楚军不出，使人辱之五六日，大司马怒，度兵汜水。士卒半渡，汉击之，大破楚军，尽得楚国金玉货赂。大司马咎、长史欣皆自刭汜水上。项羽至睢阳，闻海春侯破，乃引兵还。汉军方围钟离眛于荥阳东，项羽至，尽走险阻。韩信已破齐，使人言曰：“齐边楚，权轻，不为假王，恐不能安齐。”汉王欲攻之。留侯曰：“不如因而立之，使自为守。”乃遣张良操印绶立韩信为齐王。项羽闻龙且军破，则恐，使盱台人武涉往说韩信。韩信不听。楚汉久相持未决，丁壮苦军旅，老弱罢转饷。汉王项羽相与临广武之间而语。项羽欲与汉王独身挑战。汉王数项羽曰：“始与项羽俱受命怀王，曰先入定关中者王之，项羽负约，王我于蜀汉，罪一。项羽矫杀卿子冠军而自尊，罪二。项羽已救赵，当还报，而擅劫诸侯兵入关，罪三。怀王约入秦无暴掠，项羽烧秦宫室，掘始皇帝冢，私收其财物，罪四。又强杀秦降王子婴，罪五。诈坑秦子弟新安二十万，王其将，罪六。项羽皆王诸将善地，而徙逐故主，令臣下争叛逆，罪七。项羽出逐义帝彭城，自都之，夺韩王地，并王梁楚，多自予，罪八。项羽使人阴弑义帝江南，罪九。夫为人臣而弑其主，杀已降，为政不平，主约不信，天下所不容，大逆无道，罪十也。吾以义兵从诸侯诛残贼，使刑余罪人击杀项羽，何苦乃与公挑战！”项羽大怒，伏弩射中汉王。汉王伤匈，乃扪足曰：“虏中吾指！”汉王病创卧，张良强请汉王起行劳军，以安士卒，毋令楚乘胜于汉。汉王出行军，病甚，因驰入成皋。病愈，西入关，至栎阳，存问父老，置酒，枭故塞王欣头栎阳市。留四日，复如军，军广武。关中兵益出。当此时，彭越将兵居梁地，往来苦楚兵，绝其粮食。田横往从之。项羽数击彭越等，齐王信又进击楚。项羽恐，乃与汉王约，中分天下，割鸿沟而西者为汉，鸿沟而东者为楚。项王归汉王父母妻子，军中皆呼万岁，乃归而别去。项羽解而东归。汉王欲引而西归，用留侯、陈平计，乃进兵追项羽，至阳夏南止军，与齐王信、建成侯彭越期会而击楚军。至固陵，不会。楚击汉军，大破之。汉王复入壁，深堑而守之。用张良计，于是韩信、彭越皆往。及刘贾入楚地，围寿春，汉王败固陵，乃使使者召大司马周殷举九江兵而迎武王，行屠城父，随刘贾、齐梁诸侯皆大会垓下。立武王布为淮南王。五年，高祖与诸侯兵共击楚军，与项羽决胜垓下。淮阴侯将三十万自当之，孔将军居左，费将军居右，皇帝在后，绛侯、柴将军在皇帝后。项羽之卒可十万。淮阴先合，不利，却。孔将军、费将军纵，楚兵不利，淮阴侯复乘之，大败垓下。项羽卒闻汉军之楚歌，以为汉尽得楚地，项羽乃败而走，是以兵大败。使骑将灌婴追杀项羽东城，斩首八万，遂略定楚地。鲁为楚坚守不下。汉王引诸侯兵北，示鲁父老项羽头，鲁乃降。遂以鲁公号葬项羽谷城。还至定陶，驰入齐王壁，夺其军。正月，诸侯及将相相与共请尊汉王为皇帝。汉王曰：“吾闻帝贤者有也，空言虚语，非所守也，吾不敢当帝位。”群臣皆曰：“大王起微细，诛暴逆，平定四海，有功者辄裂地而封为王侯。大王不尊号，皆疑不信。臣等以死守之。”汉王三让，不得已，曰：“诸君必以为便，便国家。”甲午，乃即皇帝位氾水之阳。皇帝曰义帝无后。齐王韩信习楚风俗，徙为楚王，都下邳。立建成侯彭越为梁王，都定陶。故韩王信为韩王，都阳翟。徙衡山王吴芮为长沙王，都临湘。番君之将梅鋗有功，从入武关，故德番君。淮南王布、燕王臧荼、赵王敖皆如故。天下大定。高祖都洛阳，诸侯皆臣属。故临江王欢为项羽叛汉，令卢绾、刘贾围之，不下。数月而降，杀之洛阳。五月，兵皆罢归家。诸侯子在关中者复之十二岁，其归者复之六岁，食之一岁。高祖置酒洛阳南宫。高祖曰：“列侯诸将无敢隐朕，皆言其情。吾所以有天下者何？项氏之所以失天下者何？”高起、王陵对曰：“陛下慢而侮人，项羽仁而爱人。然陛下使人攻城略地，所降下者因以予之，与天下同利也。项羽妒贤嫉能，有功者害之，贤者疑之，战胜而不予人功，得地而不予人利，此所以失天下也。”高祖曰：“公知其一，未知其二。夫运筹策帷帐之中，决胜于千里之外，吾不如子房。镇国家，抚百姓，给馈饷，不绝粮道，吾不如萧何。连百万之军，战必胜，攻必取，吾不如韩信。此三者，皆人杰也，吾能用之，此吾所以取天下也。项羽有一范增而不能用，此其所以为我擒也。”高祖欲长都洛阳，齐人刘敬说，乃留侯劝上入都关中，高祖是日驾，入都关中。六月，大赦天下。十月，燕王臧荼反，攻下代地。高祖自将击之，得燕王臧荼。即立太尉卢绾为燕王。使丞相哙将兵攻代。其秋，利几反，高祖自将兵击之，利几走。利几者，项氏之将。项氏败，利几为陈公，不随项羽，亡降高祖，高祖侯之颍川。高祖至洛阳，举通侯籍召之，而利几恐，故反。六年，高祖五日一朝太公，如家人父子礼。太公家令说太公曰：“天无二日，土无二王。今高祖虽子，人主也；太公虽父，人臣也。奈何令人主拜人臣！如此，则威重不行。”后高祖朝，太公拥彗，迎门却行。高祖大惊，下扶太公。太公曰：“帝，人主也，奈何以我乱天下法！”于是高祖乃尊太公为太上皇。心善家令言，赐金五百斤。十二月，人有上变事告楚王信谋反，上问左右，左右争欲击之。用陈平计，乃伪游云梦，会诸侯于陈，楚王信迎，即因执之。是日，大赦天下。田肯贺，因说高祖曰：“陛下得韩信，又治秦中。秦，形胜之国，带河山之险，悬隔千里，持戟百万，秦得百二焉。地势便利，其以下兵于诸侯，譬犹居高屋之上建瓴水也。夫齐，东有琅邪、即墨之饶，南有泰山之固，西有浊河之限，北有勃海之利。地方二千里，持戟百万，悬隔千里之外，齐得十二焉。故此东西秦也。非亲子弟，莫可使王齐矣。”高祖曰：“善。”赐黄金五百斤。后十余日，封韩信为淮阴侯，分其地为二国。高祖曰将军刘贾数有功，以为荆王，王淮东。弟交为楚王，王淮西。子肥为齐王，王七十余城，民能齐言者皆属齐。乃论功，与诸列侯剖符行封。徙韩王信太原。七年，匈奴攻韩王信马邑，信因与谋反太原。白土曼丘臣、王黄立故赵将赵利为王以反，高祖自往击之。会天寒，士卒堕指者什二三，遂至平城。匈奴围平城，七日而后罢去。令樊哙止定代地。立兄刘仲为代王。二月，高祖自平城过赵、洛阳，至长安。长乐宫成，丞相已下徙治长安。八年，高祖东击韩王信余反寇于东垣。萧丞相营作未央宫，立东阙、北阙、前殿、武库、太仓。高祖还，见宫阙壮甚，怒，谓萧何曰：“天下匈匈苦战数岁，成败未可知，是何治宫室过度也？”萧何曰：“天下方未定，故可因遂就宫室。且夫天子四海为家，非壮丽无以重威，且无令后世有以加也。”高祖乃说。高祖之东垣，过柏人，赵相贯高等谋弑高祖，高祖心动，因不留。代王刘仲弃国亡，自归洛阳，废以为合阳侯。九年，赵相贯高等事发觉，夷三族。废赵王敖为宣平侯。是岁，徙贵族楚昭、屈、景、怀、齐田氏关中。未央宫成。高祖大朝诸侯群臣，置酒未央前殿。高祖奉玉卮，起为太上皇寿，曰：“始大人常以臣无赖，不能治产业，不如仲力。今某之业所就孰与仲多？”殿上群臣皆呼万岁，大笑为乐。十年十月，淮南王黥布、梁王彭越、燕王卢绾、荆王刘贾、楚王刘交、齐王刘肥、长沙王吴芮皆来朝长乐宫。春夏无事。七月，太上皇崩栎阳宫。楚王、梁王皆来送葬。赦栎阳囚。更命郦邑曰新丰。八月，赵相国陈豨反代地。上曰：“豨尝为吾使，甚有信。代地吾所急也，故封豨为列侯，以相国守代，今乃与王黄等劫掠代地！代地吏民非有罪也。其赦代吏民。”九月，上自东往击之。至邯郸，上喜曰：“豨不南据邯郸而阻漳水，吾知其无能为也。”闻豨将皆故贾人也，上曰：“吾知所以与之。”乃多以金啖豨将，豨将多降者。十一年，高祖在邯郸诛豨等未毕，豨将侯敞将万余人游行，王黄军曲逆，张春渡河击聊城。汉使将军郭蒙与齐将击，大破之。太尉周勃道太原入，定代地。至马邑，马邑不下，即攻残之。豨将赵利守东垣，高祖攻之，不下。月余，卒骂高祖，高祖怒。城降，令出骂者斩之，不骂者原之。于是乃分赵山北，立子恒以为代王，都晋阳。春，淮阴侯韩信谋反关中，夷三族。夏，梁王彭越谋反，废迁蜀；复欲反，遂夷三族。立子恢为梁王，子友为淮阳王。秋七月，淮南王黥布反，东并荆王刘贾地，北渡淮，楚王交走入薛。高祖自往击之。立子长为淮南王。十二年，十月，高祖已击布军会甀，布走，令别将追之。高祖还归，过沛，留。置酒沛宫，悉召故人父老子弟纵酒，发沛中儿得百二十人，教之歌。酒酣，高祖击筑，自为歌诗曰：“大风起兮云飞扬，威加海内兮归故乡，安得猛士兮守四方！”令儿皆和习之。高祖乃起舞，慷慨伤怀，泣数行下。谓沛父兄曰：“游子悲故乡。吾虽都关中，万岁后吾魂魄犹乐思沛。且朕自沛公以诛暴逆，遂有天下，其以沛为朕汤沐邑，复其民，世世无有所与。”沛父兄诸母故人日乐饮极欢，道旧故为笑乐。十余日，高祖欲去，沛父兄固请留高祖。高祖曰：“吾人众多，父兄不能给。”乃去。沛中空县皆之邑西献。高祖复留止，张饮三日。沛父兄皆顿首曰：“沛幸得复，丰未复，唯陛下哀怜之。”高祖曰：“丰吾所生长，极不忘耳，吾特为其以雍齿故反我为魏。”沛父兄固请，乃并复丰，比沛。于是拜沛侯刘濞为吴王。汉将别击布军洮水南北，皆大破之，追得斩布鄱阳。樊哙别将兵定代，斩陈豨当城。十一月，高祖自布军至长安。十二月，高祖曰：“秦始皇帝、楚隐王陈涉、魏安釐王、齐湣王、赵悼襄王皆绝无后，予守冢各十家，秦皇帝二十家，魏公子无忌五家。”赦代地吏民为陈豨、赵利所劫掠者，皆赦之。陈豨降将言豨反时，燕王卢绾使人之豨所，与阴谋。上使辟阳侯迎绾，绾称病。辟阳侯归，具言绾反有端矣。二月，使樊哙、周勃将兵击燕王绾，赦燕吏民与反者。立皇子建为燕王。高祖击布时，为流矢所中，行道病。病甚，吕后迎良医，医入见，高祖问医，医曰：“病可治。”于是高祖嫚骂之曰：“吾以布衣提三尺剑取天下，此非天命乎？命乃在天，虽扁鹊何益！”遂不使治病，赐金五十斤罢之。已而吕后问：“陛下百岁后，萧相国即死，令谁代之？”上曰：“曹参可。”问其次，上曰：“王陵可。然陵少戆，陈平可以助之。陈平智有余，然难以独任。周勃重厚少文，然安刘氏者必勃也，可令为太尉。”吕后复问其次，上曰：“此后亦非尔所知也。”卢绾与数千骑居塞下候伺，幸上病愈自入谢。四月甲辰，高祖崩长乐宫。四日不发丧。吕后与审食其谋曰：“诸将与帝为编户民，今北面为臣，此常怏怏，今乃事少主，非尽族是，天下不安。”人或闻之，语郦将军。郦将军往见审食其，曰：“吾闻帝已崩，四日不发丧，欲诛诸将。诚如此，天下危矣。陈平、灌婴将十万守荥阳，樊哙、周勃将二十万定燕、代，此闻帝崩，诸将皆诛，必连兵还乡以攻关中。大臣内叛，诸侯外反，亡可翘足而待也。”审食其入言之，乃以丁未发丧，大赦天下。卢绾闻高祖崩，遂亡入匈奴。丙寅，葬。己巳，立太子，至太上皇庙。群臣皆曰：“高祖起微细，拨乱世反之正，平定天下，为汉太祖，功最高。”上尊号为高皇帝。太子袭号为皇帝，孝惠帝也。令郡国诸侯各立高祖庙，以岁时祠。及孝惠五年，思高祖之悲乐沛，以沛宫为高祖原庙。高祖所教歌儿百二十人，皆令为吹乐，后有缺，辄补之。高帝八男：长庶齐悼惠王肥；次孝惠，吕后子；次戚夫人子赵隐王如意；次代王恒，已立为孝文帝，薄太后子；次梁王恢，吕太后时徙为赵共王；次淮阳王友，吕太后时徙为赵幽王；次淮南厉王长；次燕王建。太史公曰：夏之政忠。忠之敝，小人以野，故殷人承之以敬。敬之敝，小人以鬼，故周人承之以文。文之敝，小人以僿，故救僿莫若以忠。三王之道若循环，终而复始。周秦之间，可谓文敝矣。秦政不改，反酷刑法，岂不缪乎？故汉兴，承敝易变，使人不倦，得天统矣。朝以十月。车服黄屋左纛。葬长陵。"
    ],
    "translations": [
        "高祖，是沛郡丰邑县中阳里人，姓刘，字季。人称他的父亲为刘太公，母亲为刘媪。高祖出生之前，刘媪曾经在大泽的岸边休息，梦中与神交合。当时雷鸣电闪、天昏地暗，太公正好前去看她，见到有蛟龙在她身上。不久，刘媪有了身孕，生下了高祖。刘邦这个人，高鼻子，长着一副龙的容貌，一把漂亮的胡须，左腿上有七十二颗黑痣。他仁厚爱人，喜欢施舍助人，心胸豁达。他平素具有干大事业的气度，不干平常人家生产劳作的事。成年以后，他试着去考官，当了泗水亭这个地方的亭长。当地官署中的官吏，没有不被他捉弄的。他喜欢喝酒，好女色，常常到王媪、武负那里去赊酒喝，喝醉了躺倒就睡。武负、王媪看到他身上常有龙出现，觉得这个人很怪异。刘邦每次去买酒，留在店中畅饮，买酒的人就会增加，售出去的酒达到平常的几倍。由于出现了这种怪现象，到了年终，武负、王媪这两家就把刘邦记的账勾销了，不再向他讨账。刘邦曾经到咸阳去服徭役。有一次，秦始皇出巡，允许人们随意观看。他看到了秦始皇，长叹一声说：“唉，大丈夫就应该像这样！”单父人吕公与沛县县令要好，为躲避仇人投奔到县令这里来作客，于是就在沛县安了家。沛中的豪杰、官吏们听说县令有贵客，都前往祝贺。萧何当时是县令的属官，掌管收礼事宜。他对那些送礼的宾客们说：“送礼不满千金的，让他坐到堂下。”刘邦当时做亭长，平素就看不起这帮官吏，于是在进见的名帖上谎称“贺钱一万”，其实他一个钱也没带。名帖递进去了，吕公见了高祖大为吃惊，赶快起身，到门口去迎接他。吕公这个人，喜欢给人相面，看见高祖的相貌，就非常敬重他，把他领到堂上坐下。萧何说：“刘季一向满口说大话，很少做成什么事。”刘邦就趁机戏弄那些宾客，干脆就坐到上座去，一点儿也不谦让。酒喝得尽兴了，吕公于是向刘邦递眼色，让他一定留下来。刘邦喝完了酒，就留在后面。吕公说：“我从年轻的时候就喜欢给人相面，经我相过面的人多了，没有谁能比得上你刘季的面相，希望你好自珍爱。我有一个亲生女儿，愿意许给你做你的洒扫妻妾。”酒宴散了，吕媪对吕公大为恼火，说：“你起初总是想让这个女儿出人头地，把她许配给个贵人。沛县县令跟你要好，想娶这个女儿你不同意，今天你为什么随随便便地就把她许给刘季了呢？”吕公说：“这不是女人家所懂得的。”终于把女儿嫁给刘邦了。吕公的女儿就是吕后，生了孝惠帝和鲁元公主。刘邦做亭长的时候，经常请假回家到田里去。有一次吕后和孩子正在田中除草，有一老汉从这里经过讨水喝，吕后让他喝了水，还拿饭给他吃。老汉给吕后相面说：“夫人真是天下的贵人。”吕后又让他给两个孩子相面，他见了孝惠帝，说：“夫人所以显贵，正是因为这个男孩子。”他又给鲁元相面，也同样是富贵面相。老汉走后，刘邦正巧从旁边的房舍走来，吕后就把刚才那老人经过此地，给他们看相，说他们母子都是富贵之相的情况，原原本本地告诉了刘邦。刘邦问这个人在哪，吕后说：“还没走远。”于是刘邦就去追上了老汉，问他刚才的事，老汉说：“刚才我看贵夫人及子女的面相都很像您，您的面相简直是贵不可言。”刘邦于是道谢说：“如果真的像老人家所说，我决不会忘记你的恩德。”等到刘邦显贵的时候，最终却没有找到老汉。刘邦做亭长时，常喜欢戴一顶用竹皮编成的帽子，这是他让掌管捕盗的差役到薛地去定制的。他经常戴着，到后来显贵后仍旧经常戴着。这就是人们所说的“刘氏冠”。刘邦曾以亭长的身份，押送沛县的徒役去骊山，但有很多徒役在半路上就逃走了。刘邦估计，等到了骊山时徒役们也就逃光了。于是在走到丰西大泽中时，他让徒役们停下来饮酒休息；到了夜晚，他便把所有的役徒都放了。刘邦说：“你们都逃命去吧，从此我也要远走高飞了！”徒役中有十多个壮士愿意跟随他一块儿走。刘邦乘着酒意，趁夜抄小路通过沼泽地，他让一个人在前边先走探路。探路的人回来报告说：“前边有条大蛇挡在路上，还是回去罢。”刘邦醉意正浓，便说：“好汉走路，有什么可怕的！”于是赶到前面，拔剑去斩大蛇，大蛇被斩成两截。道路畅通了，他继续往前走了几里。刘邦醉得厉害了，就躺倒在地上，后边的人来到斩蛇的地方，看见有一老妇在暗夜中哭泣。有人问她为什么哭，老妇人说：“有人杀了我的孩子，我在为他哭泣。”那个人问：“你的孩子为什么被杀呢？”老妇说：“我的孩子是白帝之子，变化成蛇，挡在道路中间。如今被赤帝之子杀了，我就是为这个哭啊。”众人以为老妇人是在说谎，正要打她，老妇人却忽然不见了。后面的人赶上了刘邦。刘邦醒了，那些人把刚才的事告诉了他，他心中暗暗高兴，更加自负。那些追随他的人从此便渐渐地畏惧他了。秦始皇曾常说“东南方向有象征天子的云气”，于是巡游东方，想借此把它压下去。刘邦怀疑自己带着这团云气，就逃走了，躲在芒山、砀山一带的深山湖泽之间。吕后和别人一起去找，常常能找到他。高祖觉得奇怪，便问她怎么能找到。吕后说：“你所在的地方，上空常有一团云气，顺着找就常常能找到你。”高祖心里更加欢喜。沛县的年轻人中有人听说了这件事，因此许多人都愿意依附他。秦二世元年的秋天，陈胜等在蕲县起义，打到陈地的时候自称为王，定国号为“张楚”。许多郡县的人都杀了他们的长官来响应陈涉。沛县的县令非常惊恐，也想率领沛县的人响应陈涉。于是狱掾曹参、主吏萧何说：“您作为秦朝的官吏，现在想背叛秦朝，率领沛县的子弟起义，恐怕没有人会听从命令。希望您召回那些在外逃亡的人，大约可召集到几百人，用他们来胁迫众人，众人就不敢不听从命令了。”于是便派樊哙去叫刘邦。这时，刘邦的追随者已经有数十上百人了。樊哙跟着刘邦一块儿回来了。沛县县令在樊哙走后就后悔了，害怕刘邦回来后会别有用心，就关闭城门，据守城池，不让刘邦进城，而且想要杀掉萧何、曹参。萧何、曹参害怕了，翻越城墙出来依附刘邦，以求得保护。于是刘邦用帛写了封信射到城上去，向沛县的父老百姓宣告说：“天下百姓为秦政所苦已经很久了。现在父老们虽然为沛令守城，但是各地诸侯全都起来了，现在很快就要屠戮到沛县。如果现在沛县父老一起把沛令杀掉，从年轻人中选择可以拥立的人立他为首领，来响应各地诸侯，那么你们的家室就可得到保全。不然的话，全县老少都要遭屠杀，那时就什么也做不成了。”于是沛县的父老率领县中子弟一起杀掉了沛令，打开城门迎接刘邦，想要让他当沛县县令。刘邦说：“如今正当乱世，诸侯纷纷起事，如果安排的将领人选不妥当，就将一败涂地。我不是顾惜自己的性命，只是怕自己能力小，不能保全父老兄弟。这是一件大事，希望大家一起推选出能胜任的人。”萧何、曹参等都是文官，都顾惜性命，害怕起事不成遭到满门抄斩之祸，极力地推选刘邦。城中的父老也都说：“平素听说了刘邦那么多的奇异之事，必当显贵，而且占卜没有谁比得上刘邦最吉利。”刘邦还是再三推让。众人没有敢当沛县县令的，就立刘邦做了沛公。于是刘邦在沛县祭祀黄帝和蚩尤，把牲血涂在战旗战鼓上，旗帜都用红色的。由于先前杀的那条蛇是白帝之子，而杀蛇那个人是赤帝之子，所以刘邦崇尚红色。那些年轻有为的官吏如萧何、曹参、樊哙等，为沛公招收了二三千的年轻人，带领他们一起攻打了胡陵、方与，然后退回驻守在丰邑。秦二世二年，陈涉手下大将周章率军攻打到戏水，被章邯打败又退回去了。燕、赵、齐、魏各国都已自立为王，项梁、项羽也在吴县起兵。秦朝泗川郡监名叫平的率兵包围了丰邑。两天之后，沛公率众出城与秦军交战，打败了秦军。沛公命雍齿守卫丰邑，自己率领部队到薛县去。泗川郡守壮在薛县被刘邦打败，逃到戚县，被沛公的左司马曹无伤抓获杀掉了。沛公把军队撤到亢父，一直到方与，没有发生战斗。陈王胜派魏国人周巿来夺取土地。周巿派人告诉雍齿说：“丰邑，是过去魏国一度迁都过的地方。现在魏国已经收复了几十座城邑。你如果归降魏国，魏国就封你为侯驻守丰邑。如果不归降，我就要屠戮丰邑。”雍齿本来就不愿意归属于沛公，等到魏国来招降时，立刻就反叛了沛公，反过来为魏国守卫丰邑。刘邦带兵攻打丰邑，没有攻下。正好这时刘邦生病了，于是退兵回到沛县。刘邦怨恨雍齿和丰邑的子弟背叛他，又听说东阳县的宁君、秦嘉立景驹做了代理王，驻守在留县，于是前去投奔他，想向他借兵去攻打丰邑。正好这时秦朝将领章邯正在追击陈胜的军队，章邯的别将司马仁带兵向北平定楚地，屠戮了相县，到了砀县。东阳宁君和刘邦领兵向西，和司马枿交战于萧县西，战事失利。他们退回到留县收集兵卒，然后带兵攻打砀县，三天后将砀县攻了下来。于是刘邦收集砀县的兵卒，共得到五六千人。他又率兵攻打下邑，很快就攻了下来。随后刘邦退兵驻扎在丰邑城外。此时刘邦听说项梁在薛县，就带着一百多骑从前去拜见项梁。项梁给了刘邦五千士兵，五大夫级的将领十人。沛公带着他们回来后，再次带兵攻打丰邑。沛公跟从项梁一个多月后，项羽已经攻下襄城回来了。项梁把各路将领全部召到薛县。听说陈王确实是死了，因而立楚国后代怀王的孙子熊心为楚王，建都盱台。项梁自称武信君。待了几个月，他们向北攻打亢父，援救东阿，击败了秦军。齐国军队回去了，只剩下楚军单独追击败逃之敌。项梁让沛公、项羽去攻打城阳，城阳被屠戮。刘邦等驻军于濮阳县城东，和秦军交战，打败了秦军。秦军重新振作，坚守濮阳，在城周围引水防御。楚军撤退，转而攻打定陶，没有攻下。沛公和项羽又向西挺进，到了雍丘城下，和秦军交战，大败秦军，斩杀了秦将李由。接着他们掉头攻打外黄，没有攻下。项梁两次打败秦军，开始露出骄傲的神色。宋义见后进谏劝说，项梁不听。秦朝给章邯增派了军队，趁着黑夜袭击项梁军队。为了防止喧哗，章邯让士兵口里都衔着一根横木棍，结果秦军在定陶大败项梁的军队，项梁战死。这时，沛公和项羽正在攻打陈留，听说项梁已死，就和吕臣一起率军向东撤退。吕臣的军队驻扎在彭城的东面，项羽的军队驻扎在彭城的西面，沛公的军队驻扎在砀县。章邯打败了项梁的军队之后，就以为楚地的军队不值得担忧，于是渡过黄河，向北进攻赵国，大败赵军。这个时候，正是赵歇为赵王，秦将王离在巨鹿城包围了赵歇的军队，这就是所谓的“河北军”。秦二世三年，楚怀王看到项梁军已被打败，害怕了，就把都城从盱台迁到彭城。他把吕臣、项羽的军队合在一起由自己亲自率领；任命沛公为砀郡太守，封为武安侯，统率砀郡的部队；封项羽为长安侯，号称鲁公；吕臣担任司徒，他的父亲吕青担任令尹。赵国几次请求援救，怀王于是任命宋义为上将军，项羽为次将，范曾为末将，率兵向北进兵救赵。他又命令刘邦向西进军关中，并与众将约定，谁先进入函谷关平定关中，就让谁在关中做王。当时，秦军强大，常常乘胜追击败逃之敌，众将中没有人认为先入关是有利的事。只有项羽恨秦军打败了项梁的军队，很激愤，愿意和刘邦一起西进入关。怀王手下的老将们都说：“项羽这个人敏捷勇猛，却又奸猾狠毒。他曾经攻下襄城，那里的军民没有一个能活下来的，都被他活埋了。凡是他经过的地方，没有不被毁灭的。再说，楚军多次西进，如先前的陈王、项梁，都被打败了。这次不如改派个忠厚老实的人，实行仁义，率军西进，向秦地的父老兄弟讲明道理。秦地父老兄弟因为他们的君主暴虐而受苦已经很久了，现在如果真的能有位忠厚老实的长者前去，不实施暴政，应当是可以攻下的。项羽只是敏捷勇猛，不能派他去。现在只有沛公一向忠厚老实，可以派他去。”怀王听取了众人意见，最终没有答应项羽，而是派沛公率军西进。刘邦一路上收集了陈胜、项梁的众多散兵。沛公取道砀县到达成阳，与杠里的秦军对垒相持，结果击败了秦军的两支部队。此时楚军又出兵攻击王离，大败王离的军队。刘邦率兵西进，在昌邑与彭越相遇，于是和他一起攻打秦军，战事不利。他们撤兵到栗县，正好又遇到了刚武侯。刘邦把他的军队夺了过来，大约有四千人，并入了自己的军队。他又与魏将皇欣、魏申徒武蒲的军队合力攻打昌邑，没有攻下。于是刘邦继续西进，经过高阳。当时郦食其负责看管高阳城门，他说：“各路将领经过此地的多了，我看只有沛公才是个德行高尚且忠厚老实的人。”于是前去求见，游说刘邦。刘邦当时正叉开两腿坐在床上，让两个女子给他洗脚。郦食其见了并不叩拜，只是略微俯身作了个长揖，说：“如果您一定要诛灭没有德政的暴秦，就不应该坐着接见长者。”于是刘邦站起身来，整理衣服，向他道歉，请他坐上座。于是郦食其劝说刘邦袭击陈留，得到了秦军储存的大批粮食。刘邦于是封郦食其为广野君，任命他的弟弟郦商为将军，统率陈留的军队，和自己一起攻打开封，没有攻下。他继续西进，与秦将杨熊在白马打了一仗，又在曲遇东面打了一仗，大破秦军。杨熊逃到荥阳去了，秦二世派使者将他斩首示众。刘邦又转向南攻打颍阳，屠戮了颍阳。后因张良的关系，占领了韩国的轘辕险道。这时候，赵国的别将司马卬正想渡过黄河，进入函谷关。刘邦就向北进攻平阴，截断了黄河渡口。接着刘邦又挥军南下，与秦军在洛阳东面交战，战事不利，只好退回到阳城。刘邦集中军中骑兵，在犨县东和南阳太守吕齮交战，大败秦军，攻取了南阳郡。南阳郡守吕齮逃跑，退守宛城。刘邦率兵绕过宛城西进，张良进谏说：“您虽然想赶快入关，但目前秦兵数量仍旧很多，又凭借险要地势进行抵抗。如果现在不攻下宛城，那么日后宛城的敌军从背后攻击，前面又有强大的秦军，这是一条危险的道啊。”于是沛公连夜率兵从另一条道返回，他们更换了旗帜，黎明时分，把宛城紧紧围住，围了好几层。南阳郡守想要自刎，他的门客陈恢说：“现在自刎还太早。”于是越过城墙求见沛公，说：“我听说您和诸侯约定，先攻入咸阳的就让他在那里做王。现在您却停下来攻打宛城。宛城是个大郡的都城，相连的城池有几十座，人民众多，积蓄充足。官民都认为投降肯定会被杀死，所以都决心据城坚守。现在您整天停在这里攻城，士兵伤亡必定很多；如果率军离去，宛城军队一定在后面追出。这样，您向西前进会错过先进咸阳在那里称王的约定，后退又有遭受宛城强大军队袭击的后患。所以为了您着想，倒不如我们约定条件，招降南阳太守。您可封赏南阳太守为侯，仍让他留守南阳，您率领宛城的士兵一起西进。那些还没有降服的城邑，听到了这个消息，一定会争着打开城门等候您。您就可以通行无阻地西进，不必担心什么了。”沛公说：“好！”于是封宛城郡守为殷侯，封给陈恢一千户。于是沛公率兵继续西进，所经过的城邑没有不降服的。到了丹水，高武侯戚鳃、襄阳侯王陵也在西陵归降了。沛公又回军攻打胡阳，遇到了鄱君的别将梅鋗，就跟他一起，攻下了析县和郦县。沛公派遣魏国人宁昌出使秦地，宁昌还没有回来，这时秦将章邯已经在赵地率军投降项羽了。当初，项羽和宋义向北去救赵，项羽杀了宋义，代替他做了上将军，黥布等各路将领都归属了项羽；项羽打败了秦将王离的军队，降服了章邯，诸侯们都归附了项羽。赵高杀了秦二世之后，派人来求见刘邦，想和刘邦约定在关中划地称王。刘邦以为其中有诈，就用了张良的计策，派郦生、陆贾去游说秦将，并用财物进行引诱，乘他们松懈之机偷袭武关，大败秦军。接着又在蓝田南面与秦军交战。这时，刘邦增加了用以迷惑敌兵的旗帜，布下疑阵，又令全军所过之处，不得掳掠，使得秦地的人非常高兴，秦军也日益松懈，因此刘邦再次大败秦军。接着在蓝田的北面与秦军交战，又大败秦军。于是乘胜追击，终于彻底打败了秦军。汉元年十月，刘邦的军队在各路诸侯中最先到达灞上。秦王子婴驾着白车白马，用丝绳系着脖子，封好皇帝的印信，在轵道旁向刘邦投降。将领们有的说应该杀掉秦王。刘邦说：“当初怀王派我攻关中，就是认为我能宽厚容人；再说人家已经投降了，又杀掉人家，这么做不吉利。”于是把秦王交给主管官吏，自己向西进入了咸阳。刘邦进宫后就想留在秦宫中休息，樊哙、张良劝阻，刘邦这才下令把秦宫中的贵重宝器、财物和库府封好，然后退回来驻扎在灞上。刘邦召来关中各县的父老和有才德、名望的人，对他们说：“父老乡亲们，你们苦于秦朝的苛虐法令已经很久了，过去批评朝政得失的要灭族、相聚谈话的要处死。我和诸侯们约定，谁先进入关中的就在这里做王，所以我应当成为关中王。现在我和父老们约定，今后国家大法只有三条：杀人者处死，伤人者和抢劫者依法治罪。秦朝其余的法令全部废除。所有的官吏和百姓依旧像往常一样，各居其位。总之，我到这里来，就是要为父老们除害，不会对你们有任何侵害，请不要害怕！再说，我所以把军队撤回灞上，是想等各路诸侯到来，共同制定一个规约。”随即派人和秦朝的官吏一起到各县、镇、乡村去巡视，向民众讲明情况。秦地的百姓都非常喜悦，争着送来牛羊酒食，慰劳士兵。沛公推让不肯接受，说：“仓库里的粮食不少，并不缺乏，不想让大家破费。”人们更加高兴，唯恐沛公不做关中王。有人游说沛公说：“秦地的富足是其他地区的十倍，地理形势又好。现在听说章邯投降项羽，项羽给他的封号是雍王，让他在关中称王。如今要是他来了，沛公您恐怕就不能拥有这个地方了。您赶快派军队守住函谷关，不要让诸侯军进来。再逐步从关中征集兵卒，加强自己的实力，以便抵抗他们。”沛公认为他的话有道理，就依从了他的计策。十一月中旬，项羽果然率领诸侯军西进，想要进入函谷关，但发现关门紧闭着。项羽听说沛公已经平定了关中，非常恼火，就派黥布等攻克了函谷关。十二月中旬，项羽到达咸阳城东的戏亭。沛公的左司马曹无伤听说项羽发怒，想要攻打沛公，就派人去对项羽说：“沛公要在关中称王，让秦王子婴做丞相，把秦宫所有的珍宝都据为己有。”曹无伤想借此求得项羽的封赏。亚父范增劝说项羽攻打沛公。项羽立即犒劳将士，准备次日和沛公会战。这时项羽的兵力有四十万，号称百万；沛公的兵力有十万，号称二十万，实力抵不过项羽。恰巧项伯想救张良，不想让他与沛公一起送死，于是连夜赶到沛公军营见张良，因而让刘邦有机会给项羽写了封信，使项羽改变了作战的想法。次日沛公带了百余名骑随来到鸿门，向项羽道歉。项羽说：“这是沛公的左司马曹无伤说的，不然我怎么会这样呢？”沛公因为樊哙、张良的帮助，得以安全脱身返回。回到军营后，刘邦立即杀了曹无伤。项羽于是向西行进，一路屠杀，焚烧了咸阳城内的秦王朝宫室，所经过的地方，没有不遭毁灭的。秦地的人们对项羽非常失望，但又害怕，不敢不服从他。项羽派人回去向怀王报告并请示。怀王说：“按原来约定的办。”项羽怨恨怀王当初不肯让他和沛公一起西进入关，却派他到北边去救赵，结果没能率先入关，落在了别人之后。他说：“怀王是我家叔父项梁拥立的，他没有什么功劳，凭什么能主持定约呢！平定天下的，本来就是各路将领和我项籍。”于是假意推尊怀王为义帝，实际上并不听从他的命令。正月，项羽自立为西楚霸王，统治梁、楚两地的九个郡，建都彭城。又违背当初的约定，改立沛公为汉王，统治巴蜀、汉中之地，建都南郑。把关中分为三份，封给秦朝的三个降将：章邯为雍王，建都废丘；司马欣为塞王，建都栎阳；董翳为翟王，建都高奴。又封楚将瑕丘申阳为河南王，建都洛阳。封赵将司马卬为殷王，建都朝歌。把赵王歇改封到代地为代王。封赵相张耳为常山王，建都襄国。封当阳君黥布为九江王，建都六县。封怀王的柱国共敖为临江王，建都江陵。封番君吴芮为衡山王，建都邾县。封燕将臧荼为燕王，建都蓟县。把原燕王韩广改封到辽东为辽东王。韩广不听，臧荼于是率军去攻打他，并在无终把他杀了。项羽又把河间周围的三个县封给成安君陈余，让他住在南皮县。封给梅鋗十万户。四月，各路诸侯从项羽的大将军旗帜下解散，回到各自的封地去。刘邦也前往封国，项羽只派了三万士兵随从他前往，而楚国和诸侯国中因为敬慕而跟随刘邦的另有几万人。刘邦从杜县往南进入蚀地的山谷中，一路上军队过去以后，便命人把在陡壁上架起的栈道全部烧掉，以防备诸侯或其他强盗偷袭，也是向项羽表示自己没有东出之意。到达南郑时，部将和士兵中有许多人在中途开小差逃回去了，留下的士兵们也唱着歌，想东归回乡。韩信劝说汉王道：“项羽封有功的部将，却偏偏让您到南郑来，分明是流放您。部队中的军官、士兵大都是崤山以东的人，他们日夜踮起脚跟东望，盼着回归故乡。如果您趁着这种心气极高的时候利用他们，可以建大功。如果等到天下平定以后，人们都安居乐业了，就再也用不上他们了。不如立即决策，率兵东进，与诸侯争夺天下。”项羽出了函谷关后，派人让义帝迁都，并对义帝说：“古代帝王拥有方圆千里的土地，而且一定要居住在江河的上游。”派使者把义帝迁徙到长沙郡的郴县，催促他赶快起程。群臣见此，于是渐渐背叛了他。项羽就秘密命令衡山王、临江王去杀义帝，把义帝杀死在江南。项羽怨恨田荣，就封齐将田都为齐王。田荣很生气，就自立为齐王，杀掉田都，反叛楚王；又把将军印授给了彭越，让他在梁地反楚。楚派萧公角去攻打彭越，被彭越打得大败。陈余怨恨项羽不封自己为王，就派夏说去游说田荣，向他借兵攻打张耳。齐国给了陈余一些兵力，打败了常山王张耳。张耳逃走归附了汉王刘邦。陈余从代地把赵王歇接回赵国，重新立为赵王，赵王因此立陈余为代王。项羽大为恼怒，发兵亲自向北攻打齐国。八月，汉王刘邦采用韩信的计策，按原路返回关中，袭击雍王章邯。章邯在陈仓迎击汉军，雍王的军队被打败，退兵逃走；在好畤停下来再战，又被打败，逃到废丘。刘邦于是平定了雍地。他向东挺进咸阳，率军在废丘包围了雍王，并派遣将领平定了陇西、北地、上郡；派将军薛欧、王吸带兵出武关，与驻守南阳的王陵会合，到沛县去接自己的父亲太公和妻子吕后。项羽听说后，派兵在阳夏阻截，汉军不能前进。项羽又封原吴县县令郑昌为韩王，让他带兵去抵抗汉军。二年，汉王刘邦向东进攻，夺取土地，塞王司马欣、翟王董翳、河南王申阳都归降了。韩王昌不肯归降，刘邦派韩信打败了他。于是刘邦把攻占的土地设置为陇西、北地、上郡、渭南、河上、中地等郡；在关外设置了河南郡，改封韩国的太尉韩信为韩王。刘邦下令各路将领，凡是率领一万人或者献出一郡之地降汉的，封他为万户侯。他派人修筑河上郡的要塞，把原先秦朝供帝王游玩打猎的园林开放，允许人们去耕种。正月，俘虏了雍王的弟弟章平。刘邦对自己属地内的罪犯，进行大赦。汉王刘邦出了武关到达陕县，抚慰关外的父老。回来后，张耳前来求见。刘邦厚待他。二月，刘邦下令拆除了秦的社稷坛，改建汉的社稷坛。三月，刘邦从临晋渡过黄河，魏王豹带兵跟随。刘邦攻下了河内，俘虏了殷王，设置了河内郡。刘邦又率军向南渡过平阴津，到达洛阳。新城县一位掌管教化的三老董公拦住了刘邦，向他说了义帝被杀的情况。刘邦听后，袒露左臂失声大哭。随即下令为义帝发丧，哭吊三天。刘邦又派使者通告各诸侯说：“天下诸侯共同拥立义帝，称王事奉。如今项羽在江南放逐并杀害了义帝，这是大逆不道。我亲自为义帝发丧，诸侯也都应该穿白戴素。我将发动关中全部军队，聚集河南、河东、河内三郡的士兵，向南沿长江、汉水而下，我希望与诸侯王一起去打楚国那个杀害义帝的罪人！”这时，项羽正在北方攻打齐国，田荣和他交战于城阳。田荣被打败，逃往平原，平原的民众杀了他。齐国各地都归降了楚国。楚军放火焚毁了齐国的城邑，掠走了齐人的子女。齐国人十分愤怒，又反叛了楚国。田荣的弟弟田横立田荣的儿子田广为齐王。齐王已在城阳举兵反楚。项羽虽然听说了刘邦已经到东方来了，但因为已经与齐军连续作战多日，就想在打败齐军之后再去迎击汉军。刘邦因此得以挟持常山王张耳、河南王申阳、韩王郑昌、魏王魏豹、殷王司马卬等五诸侯的军队，攻入彭城。项羽闻讯，立即率兵离开齐国，从鲁县穿过胡陵到达萧县，与汉军在彭城灵壁以东的睢水上激战，大败汉军，杀得尸横遍野，以致睢水因此被阻塞不能畅流。项羽又派人从沛县掳来了刘邦的父母、妻子、儿女，把他们扣留在军中做人质。当时，诸侯们见楚军强大，刘邦被打败，又都背离了刘邦而投向楚王。塞王司马欣也逃归了楚国。吕后的哥哥周吕侯当时正率领着刘邦的一路军队驻扎在下邑。刘邦便去投奔他，并逐渐收集逃散的士卒，驻扎在砀县。然后刘邦率军向西，经过梁地，到达虞县。刘邦派使者随何到九江王黥布那里去，说：“您如果能说服黥布发兵反楚，项羽一定会暂停留在那里攻击黥布。只要项羽的军队停留几个月，我就一定能取得天下。”随何于是前往游说九江王黥布，黥布果然反叛了楚。项羽派龙且前去攻打黥布。刘邦在彭城兵败向西撤退的时候，途中派人去寻找家人，家人都已逃走，没有找到他们。败退途中只找到了孝惠。六月，刘邦立孝惠为太子，大赦罪犯。他让太子守卫栎阳，并把在关中的各诸侯的儿子也都集中到栎阳来守卫。接着，他引水灌废丘，废丘降汉，章邯自杀。刘邦把废丘改名为槐里。于是刘邦命令掌管祭祀的官吏祭祀天地、四方、上帝、山川，并形成定制，以后按时祭祀。他又发动关内的士兵，前往边塞防守敌军。当时九江王黥布正与龙且交战，失败了。黥布便跟随何一起抄小路潜行归附了刘邦。刘邦再次收拢了许多兵卒，其他各地将领及关中的军队也慢慢向荥阳聚拢，因而刘邦的军队声威大振，在京、索之间大败了楚军。汉王三年，魏王豹请假回乡去探视生病的父母，一到魏国，就毁绝了黄河的渡口，反汉助楚。刘邦派郦食其去劝说魏豹，魏豹不听。于是刘邦派将军韩信前去攻打，把魏军打得大败，俘虏了魏豹，平定了魏地，并在那里设置了河东、太原、上党等三个郡。刘邦随即命令张耳与韩信率兵东下井陉，攻打赵国，杀了陈余和赵王歇。第二年，刘邦封张耳为赵王。刘邦的军队驻扎在荥阳南面，修筑了一条甬道与黄河南岸相连接，以便取用敖仓的粮食。刘邦跟项羽互相对峙，持续了一年多。项羽多次夺取这条甬道，使刘邦军队粮食缺乏，最终项羽包围了刘邦。刘邦请求讲和，条件是把荥阳以西的地方划归为汉，项羽没有答应。刘邦为此而忧虑，于是采用陈平的计策，给了陈平黄金四万斤，用以离间项羽和范增君臣之间的关系。于是项羽便对亚父范增产生了怀疑。范增当时劝项羽前往攻取荥阳，当他遭到项羽猜疑后，非常愤怒，就托辞年老，希望项羽准许他告退回乡为民，结果还没有走到彭城就死了。汉军粮草断绝，就趁夜把二千多名身披铠甲的女子放出东门，楚军从四面追赶围攻。这时将军纪信乘坐着刘邦的车驾，假扮成刘邦的样子诳骗楚军，假装向项羽投降。楚军见此一起高呼万岁，都到城东去观看，而刘邦因此得以带着几十名随从骑兵从西城门逃走了。出城之前刘邦命令御史大夫周苛、魏豹、枞公守卫荥阳。那些不能随从刘邦出城的将领和士兵，都留在城中，周苛、枞公商量说：“魏豹是曾反叛过的侯国之王，难以和他一起守城。”于是把魏豹杀了。刘邦逃出荥阳进入关中，聚集士兵准备再次东进。袁生游说刘邦说：“我军与楚在荥阳相持不下好几年，我们常陷于不利的因境。希望大王您能够南出武关，项羽到时一定会率军南下。到时大王加高壁垒，不出战，让荥阳、成皋一带的军队得以休息。您可派韩信等去安抚河北赵地，把燕国、齐国连接起来，那时大王再兵进荥阳也不晚。这样，楚军就要多方防备，力量分散，而汉军得到了休整，再跟楚军作战，打败楚军就确定无疑了。”刘邦听从了他的计策，出兵宛县、叶县一带，与黥布一路行进、一路聚集人马。项羽听说刘邦在宛县，果然率军南下。刘邦加固壁垒，不跟他交战。这时候，彭越渡过睢水，和项声、薛公在下邳交战，彭越大败楚军。于是项羽就率军东进去攻打彭越。刘邦同时也就率军北进，驻扎在成皋。项羽打跑了彭越，听说刘邦又驻进了成皋，就率军向西，攻下了荥阳，杀死了周苛、枞公，并且俘虏了韩王信，接着包围了成皋。刘邦逃走了，只和滕公共乘一车从成皋北面的玉门逃出，往北渡过黄河，驰马跑到修武，并留宿在此。他自称是刘邦的使者，在第二天清晨闯入张耳、韩信的军营，夺了他们的军权。而后派张耳往北到赵地去大量招收兵卒，派韩信东进攻打齐国。刘邦取得了韩信的军队，重新振作起来。他率军南下临近了黄河，在小修武的南面犒劳部队，准备跟项羽再战。这时郎中郑忠劝阻刘邦，让他加深壕沟，增高壁垒坚守，不要跟楚军作战。刘邦听从了他的计谋，派卢绾、刘贾率步兵二万人、骑兵数百名，渡过白马津，进入楚地，跟彭越的军队一起在燕县城西再次打败了楚军,接着又攻下了梁地的十多座城池。淮阴侯韩信已受命东进，还没有渡过平原津。这时，刘邦却暗中派郦食其前去游说齐王田广，田广叛楚，与汉和好，共同进攻项羽。但韩信还是采用了蒯通的计策，袭击并大败了齐军。齐王用大鼎把郦食其煮死，向东逃到高密。项羽听说韩信已率河北军攻占了齐国、赵国，且将要进攻楚国，就派龙且、周兰前去攻打韩信。韩信跟他们开战，骑将灌婴出击，大败楚军，杀了龙且。齐王田广投奔彭越。这时候，彭越带兵驻在梁地，往来袭击骚扰楚军，断绝了楚军的粮食供给。汉王四年，项羽对海春侯大司马曹咎说：“请你们小心地守住成皋。如果汉军挑战，千万不要应战，只要别让他们东进就可以了。我在十五天之内一定能平定梁地，回头再跟将军们会合。”便率兵去攻打陈留、外黄、睢阳，所有城池都被攻下。这期间，汉军果然多次向楚军挑战，楚军都坚守不出。于是汉军便派人辱骂他们，接连骂了五六天。曹咎气愤之极，忍不住领兵横渡汜水应战。楚兵刚刚渡过一半，汉军便杀了出来，大败楚军，把楚国屯积的所有金玉财宝洗劫一空。大司马曹咎、长史司马欣都在汜水上自刎了。项羽到达睢阳，听说海春侯被打败，就率军赶回来。汉军这时正把钟离眛围困在荥阳东面，他们一见项羽到来，立刻全部跑到深山险要地带躲了起来。韩信攻下齐国后，派人对刘邦说:“齐国和楚国邻界，我的权力太小，如果不立个代理齐王，恐怕不能安定齐地。”刘邦听后想派兵攻打韩信。留侯张良劝说道：“不如趁此机会立他为齐王，让他自己守住齐地。”于是刘邦派张良带着印信到齐国封韩信为齐王。项羽听说龙且的军队被打败后，就害怕了，派盱台人武涉去游说韩信反汉。韩信没有同意。楚汉两军久久相持不下，胜负未决，年轻人厌倦了长期的行军作战，老弱者由于运送粮饷也疲备不堪。于是刘邦和项羽隔着广武涧相互喊话。项羽要求与刘邦单独决一雌雄，刘邦则一项一项地列举项羽的罪状说：“当初我和你项羽一同受怀王之命，说定了先入关中者在关中为王，你项羽违背了约定，让我在蜀汉为王，这是你的第一条罪状。你项羽假托怀王之命，杀了卿子冠军宋义，而自任上将军，这是你的第二条罪状。你项羽奉命援救了赵国，本应当回报怀王，而你项羽却擅自劫持诸侯的军队入关，这是你的第三条罪状。怀王当初约定入关后不准烧杀掳掠，你却焚毁秦朝宫室，挖了始皇帝坟墓，私自收取秦地的财物，这是你的第四条罪状。你强行杀掉已经投降的秦王子婴，这是你的第五条罪状。你采用欺诈手段在新安活埋了二十万秦兵，却封赏他们的降将，这是你的第六条罪状。你项羽把各诸侯的将领都封在好地方，却迁移赶走原来的诸侯王田市、赵歇、韩广等，使得他们的臣下为争王位而反叛，这是你的第七条罪状。你项羽把义帝赶出彭城，自己却在那里建都，又侵夺韩王的地盘，把梁、楚之地并在一起据为己有，这是你的第八条罪状。你项羽派人在江南秘密地杀了义帝，这是你的第九条罪状。你为人臣子却谋杀君主，杀害已经投降之人，你为政不公，不守信约，不容于天下，大逆不道，这是你的第十条罪状。如今我率领义兵和诸侯们来讨伐你这个残暴的罪人，只派那些受过刑的罪犯就可以收拾掉你项羽，又何必劳累我来跟你挑战呢？”项羽十分恼怒，令预先埋伏的弓箭手开弓射中了刘邦。刘邦被射伤了胸部，他却按着脚说：“这个强盗射中了我的脚趾！”刘邦因受箭伤而病倒了，但张良却强请他起来出去巡行，慰劳部队，以便稳定军心，不让楚军乘胜利之机攻打汉军。刘邦出去巡视军营后，病情加重了，便立即赶回了成皋。刘邦病愈后，西行入关，来到栎阳，慰问当地父老，摆设酒席，并杀了原塞王司马欣，把他的头悬挂在木杆上示众。刘邦在栎阳停留了四天，又回到军中，部队驻扎在广武。这时候，关中的军队出关参战的也增多了。这时候，彭越带兵驻在梁地，往来袭击骚扰楚军，断绝了楚军的粮食供给。田横前往梁地依附他。项羽多次攻击彭越等人，齐王韩信又进兵攻打楚军。项羽害怕了，就跟刘邦约定，平分天下，鸿沟以西的地方划归汉，鸿沟以东的地方划归楚。项羽送回了刘邦的家属，汉军官兵一见都呼喊万岁，然后双方分别回营离去。项羽罢兵回东方了，刘邦也想率军西归，后来采用张良、陈平的计策，乘楚军兵疲粮尽时，进兵追击项羽，一直追到阳夏南面才让部队停下来。刘邦曾和齐王韩信、建成侯彭越约定日期会合，共同攻击楚军，但当刘邦到达固陵时，韩信、彭越却没有来会合。楚军掉头迎击汉军，把汉军打得大败。刘邦逃回营垒，深挖壕堑，固守不出。后又采用张良的计策派使者封给韩信、彭越土地，于是韩信、彭越都来会合了。此前刘贾已率军进入楚地，围攻寿春，刘邦却在固陵打了败仗。于是他派人去召大司马周殷，让他出动九江军队去迎接武王黥布，行军途中屠戮了城父。然后随刘贾、齐梁各诸侯的军队一起会师垓下。刘邦封武王黥布为淮南王。汉王五年，刘邦和诸侯军共同进攻楚军，与项羽在垓下决战。淮阴侯韩信率领三十万大军与楚军正面对阵，他的部将孔将军在左边，费将军在右边，刘邦领兵随后，绛侯周勃、柴将军跟在刘邦的后面。项羽的军队大约有十万。淮阴侯首先跟楚军交锋，没占到便宜，向后退却。孔将军、费将军从左右两边纵兵攻上去，楚军形势不妙，淮阴侯乘势再次从正面攻上去，大败楚军于垓下。项羽的士兵夜晚听到汉军唱起了楚地的歌谣，以为汉军已经占领了全部楚地，项羽才战败逃走，于是楚军因此全部崩溃。刘邦派骑将灌婴追杀项羽，一直追到东城，杀了八万楚兵，终于平定了楚地。这时只有鲁县人还在为项羽坚守，不肯降服，因为怀王当初封项羽为鲁公。刘邦于是率领诸侯军北上，把项羽的头给鲁县的父老们看，鲁人这才投降。于是，刘邦按照鲁公这一封号的礼仪，把项羽葬在谷城。然后回师定陶，他驱马驰入齐王韩信的军营，夺了韩信的兵权。正月，诸侯及将相们共同尊请汉王刘邦为皇帝。刘邦说：“我听说皇帝的尊号，贤能的人才能据有，空言虚语不是我所要的，我可承担不了皇帝的尊号。”大臣们都说：“大王从平民起事，诛伐暴逆，平定四海，有功的分赏土地封为王侯，如果大王不称皇帝尊号，人们对大王的封赏就都不会相信。我们愿意以死相求。”汉王辞让再三，实在推辞不过了，才说：“既然诸位认为这样合适，对国家有利，那我就听从吧。”甲午日，刘邦在氾水北面登临皇帝之位。刘邦提到义帝没有后代，而齐王韩信熟悉楚地的风俗，就改封韩信为楚王，建都下邳；封建成侯彭越为梁王，建都定陶；原韩王信仍旧为韩王，建都阳翟；改封衡山王吴芮为长沙王，建都临湘。番君吴芮的部将梅鋗有功劳，曾经随汉军进入武关，所以刘邦感激吴芮。淮南王黥布、燕王臧荼、赵王张敖的封号都不改变。天下已经全部平定了，刘邦把都城定在洛阳，各路诸侯都称臣归从于刘邦。原临江王共欢仍为项羽效忠，反对刘邦。刘邦派卢绾、刘贾包围了他，没有攻下。过了几个月共欢才投降，最后被处死在洛阳。五月，士兵都被遣散回家了。各诸侯子弟留在关中护卫太子的，免除赋税徭役十二年；曾护卫过后又回封国去了的免除赋税徭役六年，另国家供养他们一年。刘邦在洛阳南宫摆设酒宴。刘邦说：“列侯和各位将领，你们不能瞒我，都要说真心话。我之所以能取得天下，是因为什么呢？项羽之所以失去天下，又是因为什么呢？”高起、王陵回答说：“陛下傲慢而且好侮辱别人，项羽仁厚而且爱护别人。但是陛下派人攻打城池夺取土地，所攻下和降服的地方就分封给人们，跟天下人同享利益。而项羽却妒贤嫉能，有功的就忌妒人家，有才能的就怀疑人家，打了胜仗不给人家授功，夺得了土地不给人家利益，这就是他失去天下的原因。”高祖说：“你们只知其一，不知其二。如果说运筹帷幄之中，决胜于千里之外，我比不上张子房；镇守国家，安抚百姓，供给粮饷，保证运粮道路不被阻断，我比不上萧何；统率百万大军，战则必胜，攻则必取，我比不上韩信。这三个人都是人中的俊杰，我能够重用他们，这就是我能够取得天下的原因所在。项羽虽然有一位范增却不重用，这就是他被我擒获的原因。”刘邦打算长期定都洛阳，齐人刘敬劝说，还有留侯张良也劝说，让刘邦进入并定都关中。于是刘邦当天就起驾入关，到关中去建都。当年六月，刘邦大赦天下。当年十月，燕王臧荼造反，攻占了代地。刘邦亲自率军前去讨代，擒获了燕王臧荼。当即刘邦封太尉卢绾为燕王，派丞相樊哙领兵去攻打代地。这一年的秋天，利几造反，刘邦又亲自带兵去讨伐，利几败逃。利几原先是项羽的部将。项羽失败时，利几是陈县县令，没有跟随项羽，逃出归降了刘邦。刘邦把他封在颍川为侯。刘邦打败燕王臧荼回到洛阳后，召见全部在册的列侯，利几心里害怕，所以就造反了。汉六年，高祖每五天朝拜太公一次，遵循一般人家父子相见的礼节。太公的管家劝说太公道：“天上不会有两个太阳，地上不应有两个君主。当今皇上在家虽然是儿子，在天下却是万民之主；太公您在家虽然是父亲，对皇上却是臣子。怎么能够叫万民之主拜见他的臣子呢！这样做，皇帝的威严就不能遍行天下了。”后来刘邦再去朝见太公，太公就抱着扫帚，面对门口倒退着走。刘邦大为吃惊，急忙下车搀扶太公。太公说：“皇上是万民之主，怎么能因为我而乱了天下的规矩呢？”于是刘邦就尊奉太公为太上皇，心里赞赏那个管家的话，赐给他五百斤黄金。十二月，有人上书报告楚王韩信谋反作乱的事，刘邦向左右大臣询问对策，大臣们都争着想去征讨。最后刘邦采用了陈平的计策，假装去游览云梦泽，在陈县召见诸侯。楚王韩信来迎接。刘邦趁机拘捕了他。当天，刘邦宣布大赦天下。这时田肯前来祝贺，趁便劝说刘邦道：“陛下抓住了韩信，又在关中建都。秦地是个形势险要之地，周围有山河环绕，与关东有千里长的疆界被山河阻隔。如果关东拥有百万军队，那么秦地只需兵力二万就可以抵挡住。秦地地势这样有利，如果对诸侯用兵，就好像从高屋檐角的瓦瓴往下流水一样，居高临下，势不可当。还有齐地，东有琅邪、即墨的富绕，南有泰山的险固，西有黄河的天险，北有渤海的地利。土地纵横各二千里，与诸侯的疆界被山水阻隔，超过千里，如果诸侯拥有百万军队，那么齐地只需二十万就可以抵挡住。所以说，齐地可以和秦地并称东秦和西秦。如果不是陛下的嫡亲子弟，其他人不可以派去做齐王。”刘邦听后说：“很好。”赏给田肯黄金五百斤。十多天以后，刘邦封韩信为淮阴侯，把他原来的封地分为两个侯国。刘邦认为将军刘贾屡次立功，就封他为荆王，统治淮水以东；又封他的弟弟刘交为楚王，统治淮水以西；封皇子刘肥为齐王，统辖七十多座城，凡是能说齐国话的老百姓都划属齐国。刘邦又评定功绩，进行封赏，与各列侯剖开封侯的符节，一半留在朝廷，一半交给受封者，以做凭证。让韩王信迁徙到太原郡。汉七年，匈奴攻打韩王信治下的马邑，韩王信就与匈奴勾结在太原谋反。此时白土县人曼丘臣、王黄拥立前赵将赵利为王，也反叛朝廷。刘邦亲自率兵前往讨伐。当时正赶上天气寒冷，士兵们被冻掉手指的有十分之二三，最后赶到了平城。匈奴军队包围了平城，七天之后才撤围离去。刘邦让樊哙留下继续平定代地，封哥哥刘仲为代王。汉七年二月，刘邦从平城出发，经过赵国、洛阳，抵达长安。长安的长乐宫已建成，于是刘邦让丞相萧何以下的官员们全都迁到长安来办公。汉八年，汉高祖刘邦又率军东进，在东垣一带追击韩王信的残余部众。当时丞相萧相何正主持未央宫的营建工作，已经建好了未央宫的东阙、北阙、前殿、武库、太仓。刘邦回来后，看到宫殿非常壮观，很生气，对萧何说：“天下动荡纷乱，苦苦征战好几年，成败还不可确知，为什么要把宫殿修造得如此豪华壮美呢？”萧何说：“正因为天下还没有安定，才可以利用这个时机建成宫殿。再说，天子以四海为家，宫殿不壮丽就无法树立天子的威严，而且也不能让后世超过呀。”高祖这才高兴起来。刘邦到东垣去，经过柏人县，赵国丞相贯高等人图谋想要谋杀高祖。刘邦本想在柏人留宿，可是心里一动，想到“柏人”字音与“迫人”相同，就没有住在那里。代王刘仲在匈奴人的攻击下弃国逃亡，回到了洛阳，高祖刘邦废掉了他的王位，改封为合阳侯。汉九年，赵国丞相贯高等人企图谋杀刘邦的事情被发觉。刘邦灭了他们的三族，废掉了赵王共敖的王位，改封为宣平侯。这一年，刘邦把原来楚国的贵族昭氏、屈氏、景氏、怀氏和原来齐国的贵族田氏等，全部迁到关中。未央宫建成了。刘邦在未央宫前殿摆设酒宴，大会诸侯、群臣。刘邦捧着玉制酒杯，起身向太上皇献酒祝寿，说：“当初您常以为我没有出息，无可倚仗，不会经营产业，比不上哥哥刘仲勤苦努力。可是现在我的产业和刘仲相比，谁的多呢？”殿上的群臣听了都高呼万岁，大笑取乐。汉十年十月，淮南王黥布、梁王彭越、燕王卢绾、荆王刘贾、楚王刘交、齐王刘肥、长沙王吴芮都到长乐宫朝见高祖刘邦。这年春天和夏天国家太平无事。这年七月，太上皇在栎阳宫去世。楚王、梁王都来送葬。刘邦赦免了栎阳的囚徒，把郦邑改名为新丰。这年八月，赵国丞相陈豨在代地造反。刘邦说：“陈豨曾经给我做事，很有信用。代地我认为是很重要的地方，所以封陈豨为列侯，以相国的身份镇守代地。如今他竟然和王黄等人在代地造反！但是代地的官吏和百姓并没有罪，全都赦免他们。”九月，刘邦亲自率军往东，前去讨伐陈豨。到达邯郸，刘邦高兴地说：“陈豨没有占据邯郸并且把漳水隔断，我就知道他是个无能的人了。”又听说陈豨的部将以前都是做生意的人，说：“我知道应该怎么对付他了。”于是拿出了许多黄金去引诱陈豨的部将，很多人都投降了。十一年，高祖在邯郸讨伐陈豨等人的战事还没有完毕，陈豨的部将侯敞带领一万多人在各地往来游击作战，王黄驻扎在曲逆，张春率军渡过黄河攻打聊城。刘邦派将军郭蒙和齐国的将领联合攻打他们，打得他们大败。太尉周勃从太原攻入，平定了代地。攻马邑时，马邑的叛军不肯降服，周勃就派军摧毁了马邑。当时陈豨的部将赵利坚守东垣，刘邦率军攻打，久攻不下。攻了一个多月，东垣的士兵在城上辱骂刘邦，刘邦大怒。等到东垣被攻下后，刘邦下令把辱骂过自己的人找出来斩了，不曾辱骂自己的人就宽恕了他们。随后刘邦把赵国常山以北的地区划归代国，立皇子刘恒为代王，建都晋阳。这年的春天，淮阴侯韩信在关中谋反，被刘邦夷灭三族。夏天，梁王彭越谋反，刘邦废掉了他的王位，把他流放到蜀地；不久他又想谋反，被夷灭三族。接着刘邦立皇子刘恢为梁王，皇子刘友为淮阳王。这年秋季七月，淮南王黥布造反，向东吞并了荆王刘贾的地盘，又北渡淮河，楚王刘交被迫逃到薛邑。汉高祖刘邦亲自率军前去讨伐，另立皇子刘长为淮南王。十二年十月，高祖刘邦在会甀击败了黥布的军队。黥布逃走，高祖派别将继续追击。高祖回京途中，路过沛县时停了下来。他在沛宫置备酒席，把过去的老朋友和他们的子弟都请来一起纵情畅饮。他从沛县儿童中挑选了一百二十人，教他们唱歌。酒喝得正痛快时，高祖自己弹击着筑琴，唱起了自己编的歌：“大风刮起来啊云彩飞扬，声威遍海内啊回归故乡，怎能得到猛士啊守卫四方！”并让儿童们跟着学唱。于是高祖起舞，他情绪激动，心中感伤，洒下了行行热泪。他对沛县的父老兄弟说：“远游的赤子总是思念着故乡。我虽然建都关中，但是将来死后我的魂魄还会思念故乡。而且我开始是以沛公的身份起兵讨伐暴逆，最终取得天下。我把沛县作为我的汤沐邑，免除沛县百姓的赋税徭役，世世代代不必纳税服役。”沛县的父老兄弟及同宗婶子、大娘、亲戚朋友天天快活饮酒，尽情欢宴，叙谈往事，取笑作乐。过了十多天，刘邦要走了，沛县父老坚决要高祖多留几日。高祖说：“我的随从人众太多，父兄们供应不起。”于是离开了沛县。这天，沛县城里全空了，百姓都赶到城西来向刘邦敬献礼物。见此情景，刘邦又停下来，搭起帐篷，痛饮了三天。沛县的父老兄弟都叩头请求说：“沛县有幸得以免除赋税徭役，丰邑却没有免除，希望陛下可怜他们。”高祖说：“丰邑是我生长的地方，我最不能忘记。只是当初丰邑人跟着雍齿反叛我而帮助魏王，我才这样的。”沛县父老兄弟仍旧坚决请求，高祖才答应把丰邑的赋税徭役也免除掉，跟沛县一样。于是封沛侯刘濞为吴王。汉将军分别在洮水南北进击黥布，都大败了叛军，在追到鄱阳时抓获了黥布，并把他斩了。樊哙另外带兵平定了代地，在当城杀了陈豨。十一月，汉高祖刘邦从讨伐黥布的前线返回长安。十二月，高祖说：“秦始皇、楚隐王陈涉、魏安釐王、齐湣王、赵悼襄王等都没有后代，分别给予守墓人十户，给秦始皇二十户，给魏公子无忌五户。”代地的官吏、百姓，凡是被陈豨、赵利所劫持的，全部赦免。当时陈豨的降将说陈豨造反时，燕王卢绾曾经派人到陈豨那里跟他密谋。刘邦派辟阳侯审食其去宣召卢绾进京，卢绾推说有病不来。辟阳侯回来后，详细报告说，卢绾确实有谋反的迹象。这年二月，高祖派樊哙、周勃带兵讨伐燕王卢绾，赦免了燕地参与造反的官吏与百姓，立皇子刘建为燕王。汉高祖刘邦在讨伐黥布的时候，被飞箭射中，在回京的路上生了病。病得很厉害，吕后为他请来了一位好医生。医生进宫拜见，刘邦问医生病情如何。医生说：“可以治好。”于是刘邦骂他说：“我一个平民，手提三尺之剑，最终取得天下，这不是由于天命吗？人的命运决定于上天，纵然你是扁鹊，对我的病又有什么用处呢！”说完并不让他治病，赏给他五十斤黄金打发走了。不久，吕后问高祖：“陛下百年之后，如果萧相国也死了，让谁来接替他做相国呢？”高祖说：“曹参可以。”又问曹参以后的事，高祖说：“王陵可以。不过他略显迂愚刚直，陈平可以帮助他。陈平智慧有余，然而难以独自担当重任。周勃深沉厚道，缺少文才，但是日后安定刘氏天下的一定是周勃，可以让他担任太尉。”吕后再问以后的事，高祖说：“再以后的事，也不是你所能知道的了。”这时卢绾带着几千骑兵在边境上等待机会，希望在高祖病愈以后，亲自到长安去请罪。四月甲辰日，刘邦在长乐宫逝世。过了四天仍没有发布丧事的消息。吕后和审食其商量说：“那些将领和皇帝以前同样都是平民百姓，后来北面称臣，他们因此常常流露出不满意、不服气的样子。现在又要侍奉年轻的新皇帝了，如果不全部族灭他们，天下就难以安定了。”有人听到了这个话，告诉了将军郦商。郦商去见审食其，说：“我听说皇帝已驾崩四天了，你们至今还不发布丧事消息，而且想要杀掉所有的将领。如果你们真的这样做，天下可就危险了。现在陈平、灌婴率领十万大军镇守荥阳，樊哙、周勃率领二十万大军在燕地和代地作战，如果他们听说皇帝驾崩了，在朝诸将都遭杀戮，必定会把军队联合在一起，回过头来进攻关中。那时候大臣们在朝廷叛乱，诸侯们在外面造反，汉朝覆亡的日子很快就要来到了。”审食其进宫把这番话告诉了吕后，于是吕后就在二十八日发布了刘邦逝世的消息，同时宣布大赦天下。卢绾听说刘邦驾崩的消息，就逃到匈奴去了。这年五月十七日，刘邦葬在了长陵。二十日，太子刘盈来到太上皇庙朝拜，大臣们都说：“高祖起事于平民，平治乱世，使之归于正道，平定了天下，是汉朝的开国皇帝，功劳最高。”于是献上尊号称刘邦为高皇帝。太子继承皇帝之号，这就是孝惠帝。孝惠帝下令，让各郡国诸侯分别建立高祖庙，每年按时祭祀。到孝惠帝五年，皇上想到高祖生前思念和喜欢沛县，就把沛宫定为高祖的原庙；高祖所教唱歌的儿童一百二十人，都让他们在原庙奏乐唱歌，以后有了缺员，就随时加以补充。高祖有八个儿子：庶出的长子是齐悼惠王刘肥；次子孝惠皇帝，是吕后的儿子；三子是戚夫人的儿子赵隐王如意；四子代王刘恒，后来被立为孝文皇帝，是薄太后的儿子；五子梁王刘恢，吕太后当政时被改封为赵共王；六子淮阳王刘友，吕太后时被改封为赵幽王；七子是淮南厉王刘长；八子是燕王刘建。太史公说：“夏朝的政治忠厚。忠厚的弊病是使得百姓粗野少礼，所以殷朝代之以恭敬。恭敬的弊病是使得百姓相信鬼神，所以周朝代之以礼仪。礼仪的弊病是使百姓不诚恳，所以要救治不诚恳的弊病，就没有什么比得上忠厚。由此看来，夏、殷、周三代开国君主的治国之道好像是循环轮转的，终而复始。至于周朝到秦朝之间，其弊病可以说就在于过分讲究礼仪了。秦朝的政治不但没有改变这种弊病，反而使刑法更加残酷，这难道不是大错特错吗？所以汉朝的兴起，前朝政治的弊端有所改变，使老百姓不至于倦怠，这是符合循环终始的天道的。规定每年十月诸侯王到京城朝见皇帝。车服有定制，皇帝的车子用黄缯做盖的里子，车横左边竖立毛羽制成的幢。安葬高祖于长陵。”"
    ],
    "marked_notes": [],
    "notes": []
}